
#####################
## Listening Ports
#####################
[Endpoint - Anomalous New Listening Port - Rule]
security_domain  = endpoint
severity         = low
rule_name        = Anomalous New Listening Port
description      = Alerts a series of hosts begin listening on a new port within 24 hours. This may be an indication that the devices have been compromised or have had new (and potentially vulnerable) software installed.
rule_title       = Anomalous New Listening Port ($transport$/$dest_port$)
rule_description = $dest_count$ hosts were found to begin listening on port $transport$/$dest_port$ within the last 24 hours. This may indicate that software was recently installed on the hosts; this software may be associated with malware which oftentimes opens a backdoor using a network port.
drilldown_name   = View systems listening on $transport$/$dest_port$
drilldown_search = | datamodel Application_State Ports search | search All_Application_State.Ports.dest_port="$dest_port$" All_Application_State.Ports.transport="$transport$"
default_status   =
default_owner    = 
search           = {\
    "version":  "1.0",\
    "searches": [\
        {"inputlookup":  {"lookupName": "listeningports_tracker", "timeField":  "firstTime"},\
         "earliest":     "-24h@h",\
         "latest":       "+0s",\
         "aggregates":   [{"function": "dc", "attribute": "dest", "alias": "dest_count"}],\
         "splitby":      [\
                          {"attribute": "transport"},\
                          {"attribute": "dest_port"}\
                         ],\
         "resultFilter": {"field": "dest_count", "comparator": ">", "value": "10"}\
        }\
    ],\
    "alert.suppress":        "1",\
    "alert.suppress.fields": ["transport","dest_port"]\
}\
         
[Endpoint - Host With Excessive Number Of Listening Ports - Rule]
security_domain  = endpoint
severity         = medium
rule_name        = Host With High Number Of Listening ports
description      = Alerts when host has a high number of listening services. This may be an indication that the device is running services that are not necessary (such as a default installation of a server) or is not running a firewall.
rule_title       = Host With High Number Of Listening Ports ($dest$)
rule_description = A host ($dest$) was detected with a high number of listening ports ($port_count$).
drilldown_name   = View listening ports on $dest$
drilldown_search = | datamodel Application_State Ports search | search All_Application_State.dest="$dest$"
default_status   =
default_owner    = 
search           = {\
    "version":  "1.0",\
    "searches": [\
        {"datamodel":	 "Application_State",\
         "object":		 "Ports",\
         "aggregates":   [{"function": "dc", "attribute": "All_Application_State.Ports.transport_dest_port", "alias": "port_count"}],\
         "splitby":      [{"attribute": "All_Application_State.dest", "alias": "dest"}],\
         "resultFilter": {"field": "port_count", "comparator": ">", "value": "20"}\
        }\
    ],\
    "alert.suppress":        "1",\
    "alert.suppress.fields": ["dest"]\
}\


#####################
## Malware
#####################
[Endpoint - High Number of Hosts Not Updating Malware Signatures - Rule]
security_domain  = endpoint
severity         = high
rule_name        = High Number of Hosts Not Updating Malware Signatures
description      = Alerts when a high number of hosts not updating malware signatures have been discovered.  These hosts should be evaluated to determine why they are not updating their malware signatures.
rule_title       = High Number of Hosts Not Updating Malware Signatures
rule_description = A high number of hosts not updating malware signatures have been discovered.  $count$ hosts have not updated malware signatures in the last week. These hosts should be evaluated to determine why they are not updating their malware signatures.
drilldown_name   = View systems not updating malware signatures
drilldown_search = | `malware_operations_tracker` | rename _time_signature_version as _time | `dayDiff(_time)` | search dayDiff>7 | sort - dayDiff | table _time,dest,dest_nt_domain,product_version,signature_version,vendor_product,dayDiff
default_status   =
default_owner    = 

[Endpoint - High Number Of Infected Hosts - Rule]
security_domain  = endpoint
severity         = high
rule_name        = High Number Of Infected Hosts
description      = Alerts when a high total number of infected hosts is discovered.
rule_title       = High Number Of Infected Hosts ($infected_hosts$)
rule_description = A high number of total infected systems was discovered. $infected_hosts$ hosts currently have an infection that was active in the last 15 days.
drilldown_name   = View all malware infections
drilldown_search = | datamodel Malware Malware_Attacks search
default_status   =
default_owner    =
search           = {\
    "version":  "1.0",\
    "searches": [\
        {"datamodel":	 "Malware",\
         "object":		 "Malware_Attacks",\
         "aggregates":   [{"function": "estdc", "attribute": "Malware_Attacks.dest", "alias": "infected_hosts"}],\
         "resultFilter": {"field": "infected_hosts", "comparator": ">", "value": "100"}\
        }\
    ],\
    "alert.suppress":        "1",\
    "alert.suppress.fields": ["const_dedup_id"]\
}\

[Endpoint - High Or Critical Priority Host With Malware - Rule]
security_domain  = endpoint
severity         = high
rule_name        = High Or Critical Priority Host With Malware Detected
description      = Alerts when an infection is noted on a host with high or critical priority.
rule_title       = 
rule_description = A high or critical priority host ($dest$) was detected with malware.
drilldown_name   = View infections on $dest$
drilldown_search = | datamodel Malware Malware_Attacks search | search Malware_Attacks.dest="$dest$"
default_status   =
default_owner    = 
search           = {\
    "version":  "1.0",\
    "searches": [\
        {"datamodel":	"Malware",\
         "object":		"Malware_Attacks",\
         "eventFilter": "('Malware_Attacks.dest_priority'=\"high\" OR 'Malware_Attacks.dest_priority'=\"critical\")",\
         "aggregates":  [{"function": "max", "attribute": "_time", "alias": "lastTime"},\
                         {"function": "latest", "attribute": "_raw", "alias": "orig_raw"},\
                         {"function": "values", "attribute": "Malware_Attacks.dest_priority", "alias": "dest_priority"},\
                         {"function": "count"}\
                        ],\
         "splitby":     [\
                         {"attribute": "Malware_Attacks.dest", "alias": "dest"},\
                         {"attribute": "Malware_Attacks.signature", "alias": "signature"}\
                        ]\
        }\
    ],\
    "alert.suppress":        "1",\
    "alert.suppress.fields": ["dest","signature"]\
}\

[Endpoint - Host With Multiple Infections - Rule]
security_domain  = endpoint
severity         = high
rule_name        = Host With Multiple Infections
description      = Alerts when a host with multiple infections is discovered.
rule_title       = Host With Multiple Infections ($dest$)
rule_description = The device $dest$ was detected with multiple ($infection_count$) infections.
drilldown_name   = View all infection events associated with device $dest$
drilldown_search = | datamodel Malware Malware_Attacks search | search Malware_Attacks.dest="$dest$"
default_status   =
default_owner    = 
search           = {\
    "version":  "1.0",\
    "searches": [\
        {"datamodel":    "Malware",\
         "object":       "Malware_Attacks",\
         "aggregates":   [{"function": "dc", "attribute": "Malware_Attacks.signature", "alias": "infection_count"}],\
         "splitby":      [{"attribute": "Malware_Attacks.dest", "alias": "dest"}],\
         "resultFilter": {"field": "infection_count", "comparator": ">", "value": "1"}\
        }\
    ],\
    "alert.suppress":        "1",\
    "alert.suppress.fields": ["dest"]\
}\

[Endpoint - Old Malware Infection - Rule]
security_domain  = endpoint
severity         = high
rule_name        = Host With Old Infection Or Potential Re-Infection
description      = Alerts when a host with an old infection is discovered (likely a re-infection).
rule_title       = Host With Old Infection Or Potential Re-Infection ($signature$ On $dest$)
rule_description = The device $dest$ was detected with malware '$signature$' that was present $dayDiff$ days ago. This is either an old infection or a re-infection.
drilldown_name   = View all $signature$ events for $dest$
drilldown_search = | datamodel Malware Malware_Attacks search | search Malware_Attacks.dest="$dest$" Malware_Attacks.signature="$signature$"
default_status   =
default_owner    = 

[Endpoint - Outbreak Observed - Rule]
security_domain  = endpoint
severity         = high
rule_name        = Outbreak Detected
description      = Alerts when a potential outbreak is observed based on newly infected systems all exhibiting the same infection
rule_title       = Outbreak Detected Of $signature$
rule_description = A potential outbreak was noted. $system_count$ hosts have been detected as newly infected by $signature$ within the past 24 hours.
drilldown_name   = View events associated with potential outbreak of $signature$
drilldown_search = | datamodel Malware Malware_Attacks search | search Malware_Attacks.signature="$signature$"
default_status   =
default_owner    = 
search           = {\
    "version":  "1.0",\
    "searches": [\
        {"datamodel":    "Malware",\
         "object":       "Malware_Attacks",\
         "aggregates":   [{"function": "dc", "attribute": "Malware_Attacks.dest", "alias": "system_count"}],\
         "splitby":      [{"attribute": "Malware_Attacks.signature", "alias": "signature"}],\
         "resultFilter": {"field": "system_count", "comparator": ">", "value": "10"}\
        }\
    ],\
    "alert.suppress":        "1",\
    "alert.suppress.fields": ["signature"]\
}\


######################
##  Primary Functions
######################
[Endpoint - Multiple Primary Functions Detected - Rule]
security_domain  = endpoint
severity         = medium
rule_name        = Multiple Primary Functions Detected
description      = Multiple Primary Functions Detected
rule_title       = Multiple Primary Functions Detected
rule_description = System $dest$ has multiple ($function_count$) primary functions ($function$) enabled
drilldown_name   = View primary functions on $dest$
drilldown_search = | `primary_functions_tracker`| search dest=$dest$ | table dest, dest_port, transport, function
default_status   =
default_owner    = 


#####################
## Processes
#####################
[Endpoint - Anomalous New Processes - Rule]
security_domain  = endpoint
severity         = medium
rule_name        = Anomalous New Process
description      = Alerts when an anomalous number hosts are detected with a new process.
rule_title       = Anomalous New Process ($process$)
rule_description = An suspicious number of new processes were identified. $dest_count$ hosts were discovered with new instances of $process$ in the last 24 hours.
drilldown_name   = View all instances of $process$
drilldown_search = | `datamodel("Application_State","Processes")` | search All_Application_State.process="$process$"
default_status   =
default_owner    = 
search           = {\
    "version":  "1.0",\
    "searches": [\
        {"inputlookup":  {"lookupName": "localprocesses_tracker", "timeField":  "firstTime"},\
         "earliest":     "-24h@h",\
         "latest":       "+0s",\
         "aggregates":   [{"function": "dc", "attribute": "dest", "alias": "dest_count"}],\
         "splitby":      [{"attribute": "process"}],\
         "resultFilter": {"field": "dest_count", "comparator": ">", "value": "9"}\
        }\
    ],\
    "alert.suppress":        "1",\
    "alert.suppress.fields": ["process"]\
}\

[Endpoint - Host With Excessive Number Of Processes - Rule]
security_domain  = endpoint
severity         = medium
rule_name        = High Process Count
description      = Alerts when host has a high number of processes. This may be due to an infection or a runaway process.
rule_title       = Host With High Process Count ($dest$)
rule_description = A host ($dest$) was detected with a high number of processes ($process_count$).
drilldown_name   = View processes on $dest$
drilldown_search = | datamodel Application_State Processes search | search All_Application_State.dest="$dest$"
default_status   =
default_owner    = 

[Endpoint - Prohibited Process Detection - Rule]
security_domain  = endpoint
severity         = medium
rule_name        = Prohibited Process Detected
description      = Alerts when a service in the prohibited process list is detected.
rule_title       = Prohibited Process Detected ($process$)
rule_description = A prohibited process ($process$) was detected.
drilldown_name   = View instances of $process$
drilldown_search = | `datamodel("Application_State","Processes")` | search All_Application_State.process=$process$
default_status   =
default_owner    = 


#####################
## Services
#####################
[Endpoint - Anomalous New Services - Rule]
security_domain  = endpoint
severity         = medium
rule_name        = Anomalous New Service
description      = Alerts when an anomalous number hosts are detected with a new service.
rule_title       = Anomalous New Service ($service$)
rule_description = An suspicious number of new services were identified. $dest_count$ hosts were discovered with new instances of the $service$ service in the last 24 hours.
drilldown_name   = View all instances of $service$
drilldown_search = | `datamodel("Application_State","Services")` | search All_Application_State.service="$service$"
default_status   =
default_owner    = 
search           = {\
    "version":  "1.0",\
    "searches": [\
        {"inputlookup":  {"lookupName": "services_tracker", "timeField":  "firstTime"},\
         "earliest":     "-24h@h",\
         "latest":       "+0s",\
         "aggregates":   [{"function": "dc", "attribute": "dest", "alias": "dest_count"}],\
         "splitby":      [{"attribute": "service"}],\
         "resultFilter": {"field": "dest_count", "comparator": ">", "value": "9"}\
        }\
    ],\
    "alert.suppress":        "1",\
    "alert.suppress.fields": ["service"]\
}\

[Endpoint - Host With Excessive Number Of Services - Rule]
security_domain  = endpoint
severity         = medium
rule_name        = Host With High Number Of Services
description      = Alerts when host has a high number of services. This may be an indication that the device is running services that are not necessary (such as a default installation of a server).
rule_title       = Host With High Number Of Services ($dest$)
rule_description = A host ($dest$) was detected with a high number of services ($service_count$).
drilldown_name   = View services on $dest$
drilldown_search = | datamodel Application_State Services search | search All_Application_State.dest="$dest$"
default_status   =
default_owner    = 
search           = {\
    "version":  "1.0",\
    "searches": [\
        {"datamodel":	 "Application_State",\
         "object":		 "Services",\
         "aggregates":   [{"function": "dc", "attribute": "All_Application_State.Services.service", "alias": "service_count"}],\
         "splitby":      [{"attribute": "All_Application_State.dest", "alias": "dest"}],\
         "resultFilter": {"field": "service_count", "comparator": ">", "value": "100"}\
        }\
    ],\
    "alert.suppress":        "1",\
    "alert.suppress.fields": ["dest"]\
}\

[Endpoint - Prohibited Service Detection - Rule]
security_domain  = endpoint
severity         = medium
rule_name        = Prohibited Service Detected
description      = Alerts when a service in the prohibited service list is detected.
rule_title       = Prohibited Service Detected ($service$)
rule_description = A prohibited service ($service$) was detected.
drilldown_name   = View instances of service $service$
drilldown_search = | `datamodel("Application_State","Services")` | search All_Application_State.service="$service$"
default_status   =
default_owner    = 

[Endpoint - Host Sending Excessive Email - Rule]
security_domain  = endpoint
severity         = high
rule_name        = Host Sending Excessive Email
description      = Alerts when an host not designated as an e-mail server sends excessive e-mail to one or more target hosts.
rule_title       = Host Sending Excessive Email ($src$)
rule_description = The device $src$ was detected making $count$ SMTP connections to $dest_count$ destinations.
drilldown_name   = View email-related traffic for source $src$ for this event
drilldown_search = | datamodel Network_Traffic All_Traffic search | where 'All_Traffic.src'="$src$" AND ('All_Traffic.dest_port'=25 OR 'All_Traffic.dest_translated_port'=25 OR 'All_Traffic.dest_port'=587 OR 'All_Traffic.dest_translated_port'=587)
default_status   =
default_owner    = 

## commenting guided mode for now, as this implementation does not allow for the
## multi-part where clause "where (count>250 OR dest_count>25)"
#search           = {\
#    "version":  "1.0",\
#    "searches": [\
#        {"datamodel":    "Network_Traffic",\
#         "object":       "All_Traffic",\
#         "eventFilter":  "'All_Traffic.src_category'!=\"email_servers\" AND ('All_Traffic.dest_port'=25 OR 'All_Traffic.dest_translated_port'=25 OR 'All_Traffic.dest_port'=587 OR 'All_Traffic.dest_translated_port'=587)",\
#         "aggregates":   [\
#                          {"function": "dc", "attribute": "All_Traffic.dest", "alias": "dest_count"},\
#                          {"function": "count"}\
#                         ],\
#         "splitby":      [{"attribute": "All_Traffic.src", "alias": "src"}],\
#         "resultFilter": {"field": "count", "comparator": ">", "value": "250"}\
#        }\
#    ],\
#    "alert.suppress":        "1",\
#    "alert.suppress.fields": ["src"]\
#}\

#####################
## User Accounts
#####################
[Endpoint - Anomalous User Account Creation - Rule]
security_domain  = endpoint
severity         = medium
rule_name        = New User Account Created On Multiple Hosts
description      = Alerts when numerous new accounts are created for a username accounts multiple hosts.
rule_title       = User Account ($user$) Created On $dest_count$ Hosts
rule_description = A user account ($user$) was created on several $dest_count$ hosts in the last 24 hours.
drilldown_name   = View activity for account $user$
drilldown_search = | datamodel Compute_Inventory User search | search All_Inventory.User.user="$user$"
default_status   =
default_owner    = 
search           = {\
    "version":  "1.0",\
    "searches": [\
        {"inputlookup":  {"lookupName": "useraccounts_tracker", "timeField":  "firstTime"},\
         "earliest":     "-24h@h",\
         "latest":       "+0s",\
         "aggregates":   [{"function": "dc", "attribute": "dest", "alias": "dest_count"}],\
         "splitby":      [{"attribute": "user"}],\
         "resultFilter": {"field": "dest_count", "comparator": ">", "value": "3"}\
        }\
    ],\
    "alert.suppress":        "1",\
    "alert.suppress.fields": ["user"]\
}\

