###### Globals ######

## Syslog messages and the text files have the same CSV structure AFTER the timestamp or syslog header. 
## The message field consists of that content
[message_for_sep_log_files]
REGEX = ^\d+\-\d\d\-\d\d\s\d\d:\d\d:\d\d,(Info,|Error,|Minor,|Major,|Critical,)?(.*)
FORMAT = message::$2

[message_for_sep_syslog]
REGEX = SymantecServer\s\S+:\s(.*)
FORMAT = message::$1

## Route syslog (sep) to correct sub-sourcetype transforms.conf
[force_sourcetype_sep_scm_system]
#(Overlaps with admin and policy) - so this goes first!
REGEX = (Site:\s[^,]+,Server:\s[^,]+,)
DEST_KEY = MetaData:Sourcetype
FORMAT = sourcetype::sep:scm_system

[force_sourcetype_sep_proactive]
REGEX = (Detection type:)
DEST_KEY = MetaData:Sourcetype
FORMAT = sourcetype::sep:proactive

[force_sourcetype_sep_behavior]
REGEX = (Begin:\s.*,End:\s.*,Rule:)
DEST_KEY = MetaData:Sourcetype
FORMAT = sourcetype::sep:behavior

[force_sourcetype_sep_risk]
REGEX = (Security risk|Virus)\sfound,
DEST_KEY = MetaData:Sourcetype
FORMAT = sourcetype::sep:risk

[force_sourcetype_sep_admin]
REGEX = (Domain:\s([^,]{0,25}),Admin:)
DEST_KEY = MetaData:Sourcetype
FORMAT = sourcetype::sep:admin

[force_sourcetype_sep_agent] 
REGEX = (,The\smanagement\sserver|,The\sclient)
DEST_KEY = MetaData:Sourcetype
FORMAT = sourcetype::sep:agent

[force_sourcetype_sep_policy]
#(OVERLAPS with admin, as both have "admin" - policy added to discriminate)
REGEX = Admin:\s[^,]+,.*([Pp]olicy)
DEST_KEY = MetaData:Sourcetype
FORMAT = sourcetype::sep:policy

[force_sourcetype_sep_agt_system]
REGEX = ,Category:\s\d+,(Smc|Symantec|SYLINK)
DEST_KEY = MetaData:Sourcetype
FORMAT = sourcetype::sep:agt_system

[force_sourcetype_sep_scan]
REGEX = Scan\sID:\s(\d+)
DEST_KEY = MetaData:Sourcetype
FORMAT = sourcetype::sep:scan

[force_sourcetype_sep_security]
REGEX = (,\[SID:\s\d+\])
DEST_KEY = MetaData:Sourcetype
FORMAT = sourcetype::sep:ids

[force_sourcetype_sep_traffic]
REGEX = (Local:\s\S+,Remote)
DEST_KEY = MetaData:Sourcetype
FORMAT = sourcetype::sep:traffic

## SEP Actions - map to allow, block, deferred
## For details: http://service1.symantec.com/SUPPORT/ent-security.nsf/docid/2006112010562148
[sep_action_lookup]
filename = sep_actions.csv

[sep_vendor_info_lookup]
filename = sep_vendor_info.csv

## These extracts apply to cases where the field name is within the data
## for example " ,Computer name: foobar," becomes a dest_nt_host of foobar
## They are "generic" in that they apply to multiple SEP engines, hence the "_all"

[dest_nt_host_for_sep_all]
REGEX = Computer(\s[nN]ame)?:\s([^,]+)
FORMAT = dest_nt_host::$2

[dest_nt_domain_for_sep_all]
REGEX = Domain:\s([^,\(]+)
FORMAT = dest_nt_domain::$1

[user_for_sep_all]
REGEX = ,User:\s([^,]+)
FORMAT = user::$1

[dvc_nt_host_for_sep_all]
REGEX = Server:\s([^,]+)
FORMAT = dvc_nt_host::$1


###### SEP Admin ######
## CSV Headers; original SEP field names replaced to with CIM
[csv_header_for_sep_admin]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "site name","server name","domain name","admin","signature"

[dest_nt_host_for_sep_admin]
REGEX = ,Server,:\s([^,]+)
FORMAT = dest_nt_host::$1

[user_for_sep_admin]
REGEX = Admin:\s([^,]+)
FORMAT = user::$1


###### SEP Agent ######
[csv_header_for_sep_agent]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "site name","server","domain name","event description","dest_nt_host","user","dest_nt_domain"


###### SEP AGT System ######
[csv_header_for_sep_agt_system]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "dest_nt_host","category","event source","sep_name"

[name_dvc_ip_for_sep_agt_system]
SOURCE_KEY = sep_name
REGEX = ([^\(]+)(\(([^\)]+))?
FORMAT = name::$1 dvc_ip::$3

[product_version_for_sep_agt_system]
REGEX = Engine\sversion:\s(\S+)
FORMAT = product_version::$1

[sig_version_for_sep_agt_system]
REGEX = definition file loaded\.\s+Version\:\s+(.*?)\.
FORMAT = signature_version::$1


###### SEP Behavior ######
[csv_header_for_sep_behavior]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "dest_nt_host","action","description","api","begin time","end time","rule name","pid","process","return address","return module","parameter","user name","domain name"

[signature_for_sep_behavior]
REGEX = ,Rule:\s([^,]+)
FORMAT = signature::$1 

[file_name_path_for_sep_behavior]
SOURCE_KEY = process
REGEX = (.+)(\\|/)([^,]+)
#(.*)/([^,]+)
FORMAT = file_path::$1 file_name::$3


###### SEP IDS ######
[csv_header_for_sep_security]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "dest_nt_host","sep_name","local_host_ip","local_host_mac","remote_host_name","remote_host_ip","remote_host_mac","traffic_direction","network_protocol","hack_type","begin_time","end_time","occurrences","application_name","location","user_name","sep_domain"

[sep_name_as_signature]
REGEX = \[SID:\s+(\d+)\]\s+([^\.,]+)
FORMAT = signature_id::$1 signature::$2

[src_dest_addr_inbound_for_sep_security]
REGEX =  Local:\s(\d+\.\d+\.\d+\.\d+),Local:\s(\S+),Remote:\s(\S+)?,Remote:\s(\d+\.\d+\.\d+\.\d+),Remote:\s(\S+),Inbound
FORMAT = dest_ip::$1 dest_mac::$2 src_ip::$4 src_mac::$5

[src_dest_addr_outbound_for_sep_security]
REGEX =  Local:\s(\d+\.\d+\.\d+\.\d+),Local:\s(\S+),Remote:\s(\S+)?,Remote:\s(\d+\.\d+\.\d+\.\d+),Remote:\s(\S+),Outbound
FORMAT = src_ip::$1 src_mac::$2 dest_ip::$4 dest_mac::$5

[application_file_for_sep_security]
REGEX = Application:\s((.*)/([^,]+))
FORMAT = application::$1 file_path::$2 file_name::$3

[action_for_sep_security]
REGEX = has\s+been\s+(allowed|blocked)
FORMAT = action::$1


###### SEP Policy ######
[csv_header_for_sep_policy]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "site name","dest_nt_host","sep_nt_domain","admin name","change","object_name"
## the user is "admin: user_id" so we use a report extract instead of CSV header
[user_for_sep_policy]
REGEX = ,Admin:\s([^,]+)
FORMAT = user::$1
## Command is the policy "change" plus "object"

[command_for_sep_policy]
REGEX = Admin:\s[^,]+,(.*)
FORMAT = command::$1

[vendor_action_success_for_sep_policy]
REGEX = (Policy\s+has\s+been\s+edited|Add\s+shared\s+policy)
FORMAT = vendor_action::"$1"


###### SEP Proactive ######
[csv_header_for_sep_proactive]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "name","computer name","detection type","application name","application type","application version","sep hash type","sep application hash","sep company name","file size bytes","sensitivity","detection score","submission recommendation","permitted application reason","source","risk name","occurrences","process","description","actual action","requested action","secondary action","event time","event insert time","end time","domain name","group name","server name","user name","source computer name","source computer ip"

[application_name_for_sep_proactive]
REGEX = Application\sname:\s([^,]+)
FORMAT = application_name::$1

[application_type_for_sep_proactive]
REGEX = Application\stype:\s([^,]+)
FORMAT = application_type::$1


###### SEP Risk ###### 
[csv_header_for_sep_risk]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "name","computer_name","source","risk name","occurrences","process","description","sep_action","sep requested action","sep secondary action","event time","event insert time","end time","domain name","group name","server name","sep user name","source computer name","source computer ip"

[signature_for_sep_risk]
REGEX = Risk\sname:\s([^,]+)
FORMAT = signature::$1

[file_name_path_for_sep_risk]
SOURCE_KEY = process
REGEX = ((.+)(\\|/))?([^,]+)
FORMAT = file_path::$1 file_name::$4

[action_taken_for_sep_risk]
REGEX = Actual\saction:\s([^,]+)
FORMAT = action_taken::$1

[requested_action_for_sep_risk]
REGEX = Requested action:\s([^,]+)
FORMAT = requested_action::$1

[secondary_action_for_sep_risk]
REGEX = Secondary action:\s([^,]+)
FORMAT = secondary_action::$1


###### SEP Scan ######
[csv_header_for_sep_scan]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "scan id","begin time","end time","status","duration_secs","user","client user 2","start message","stop message","command","threats","infected","total files","omitted","computer name","dest_ip","domain name","group name","server name"

[dest_nt_host_for_sep_scan]
REGEX = Computer:\s([^,]+)
FORMAT = dest_nt_host::$1

[dest_ip_for_sep_scan]
REGEX = ,IP\sAddress:\s([^,]+)
FORMAT = dest_ip::$1

[user_for_sep_scan]
REGEX = User1:\s([^,]+)
FORMAT = user::$1

[duration_for_sep_scan]
REGEX = Duration\s(seconds):\s(\d+)
FORMAT = duration_secs::$1

[infected_count_for_sep_scan]
REGEX = Infected:\s(\d+)
FORMAT = infected_count::$1

[threat_count_for_sep_scan]
REGEX = Threats:\s(\d+)
FORMAT = threat_count::$1

[dest_ip_for_sep_scan]
REGEX = IP\sAddress:\s(\d+\.\d+\.\d+\.\d+)
FORMAT = dest_ip::$1


###### SEP SCM System ######
[csv_header_for_sep_scm_system]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "site name","sep_server","event description"

[version_for_sep_scm_system]
REGEX = Win\d\d\s(\S+)
FORMAT = version::$1


###### SEP Traffic ######
[csv_header_for_sep_traffic]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "sep_host","local host ip","local port","local host mac","remote host ip","remote host name","remote port","remote host mac","network protocol","direction","begin time","end time","occurrences","application name","rule name","location","user name","domain name","sep_action"

[src_nt_host_outbound_for_sep_traffic]
SOURCE_KEY = message
REGEX = ^([^,]+).*,Outbound
FORMAT = src_nt_host::$1

[dest_nt_host_inbound_for_sep_traffic]
SOURCE_KEY = message
REGEX = ^([^,]+).*,Inbound
FORMAT = dest_nt_host::$1

[inbound_addresses_for_sep_traffic]
REGEX = Local:\s+(\d+\.\d+\.\d+\.\d+)?,Local:\s+(\d+)?,Local:\s+([a-fA-F0-9]{12})?,Remote:\s+(\d+\.\d+\.\d+\.\d+)?,Remote:[^,]+,Remote:\s+(\d+)?,Remote:\s+([a-fA-F0-9]{12})?,(\S+),(Inbound).*Domain:\s([^,]+)
FORMAT = dest_ip::$1 dest_port::$2 dest_mac::$3 src_ip::$4 src_port::$5 src_mac::$6 proto::$7 vendor_direction::$8 dest_nt_domain::$9

[outbound_addresses_for_sep_traffic]
REGEX = Local:\s+(\d+\.\d+\.\d+\.\d+)?,Local:\s+(\d+)?,Local:\s+([a-fA-F0-9]{12})?,Remote:\s+(\d+\.\d+\.\d+\.\d+)?,Remote:[^,]+,Remote:\s+(\d+)?,Remote:\s+([a-fA-F0-9]{12})?,(\S+),(Outbound).*Domain:\s([^,]+)
FORMAT = src_ip::$1 src_port::$2 src_mac::$3 dest_ip::$4 dest_port::$5 dest_mac::$6 proto::$7 vendor_direction::$8 src_nt_domain::$9

[sep_direction_lookup]
filename = sep_directions.csv

[vendor_action_for_sep_traffic]
REGEX = Action:\s(\w+)
FORMAT = vendor_action::$1