# Copyright (C) 2005-2011 Splunk Inc. All Rights Reserved.
# DO NOT EDIT THIS FILE!
# Please make all changes to files in $SPLUNK_HOME/etc/apps/Splunk_TA_windows/local.
# To make changes, copy the section/stanza you want to change from $SPLUNK_HOME/etc/apps/Splunk_TA_windows/default
# into ../local and edit there.
#

###### DHCP ######
[auto_kv_for_microsoft_dhcp]
DELIMS = ","
FIELDS = msdhcp_id,date,time,description,dest_ip,dest_nt_host,dest_mac

[dest_nt_host_as_dest]
SOURCE_KEY = dest_nt_host
REGEX = (.+)
FORMAT = dest::"$1"

[dest_mac_as_dest]
SOURCE_KEY = dest_mac
REGEX = (.+)
FORMAT = dest::"$1"

[dest_ip_as_dest]
SOURCE_KEY = dest_ip
REGEX = (.+)
FORMAT = dest::"$1"

[msdhcp_signature_lookup]
filename = msdhcp_signatures.csv


###### MonitorWare Windows Event Log ######
[force_sourcetype_for_monitorware]
DEST_KEY = MetaData:Sourcetype
REGEX = EvntSLog\:\s+[^\t]*\t[^\t]*\t([^\t]*)\t[^\t]*\t([^\t]*)\t([^\t]*)
FORMAT = sourcetype::MonitorWare:$3

[force_host_for_monitorware]
DEST_KEY = MetaData:Host
REGEX = EvntSLog\:\s+[^\t]*\t[^\t]*\t([^\t]*)\t[^\t]*\t([^\t]*)\t([^\t]*)
FORMAT = host::$1

[force_source_for_monitorware]
DEST_KEY = MetaData:Source
REGEX = EvntSLog\:\s+[^\t]*\t[^\t]*\t([^\t]*)\t[^\t]*\t([^\t]*)\t([^\t]*)
FORMAT = source::MonitorWare:$3

[raw_kv_for_tab_monitorware]
DELIMS = "\t"
FIELDS = monitorware_log_type,end_time,RecordNumber,ComputerName,Type,EventCode,LogName,SourceName,CategoryString,monitorware_user,Message

[Message_kv_for_tab_monitorware]
SOURCE_KEY = Message
#REGEX = (\w[\w ]+)[:](((\x20\x20\x20\x20\x0A)|(\x20\x20\x20\x20)|(\x20\x20\x20)|($))|(((\x20){1,3}(.*?))?((\x20\x20\x20\x20\x0A)|(\x20\x20\x20\x20)|(\x20\x20\x20)|($))))
REGEX = (\w[\w ]+)[:](((\x20\x20\x20\x20\x0A)|(\x20\x20\x20\x20)|($))|(((\x20){1,3}(.*?))?((\x20\x20\x20\x20\x0A)|(\x20\x20\x20\x20)|(\x20\x20\x20)|($))))
FORMAT = $1::$2
MV_ADD = true

[Failure_Reason_for_monitorware]
SOURCE_KEY = Failure_Information
REGEX = ([^:]+)\:\s+(.+)
FORMAT = $1::$2

[User_for_monitorware]
SOURCE_KEY = monitorware_user
REGEX = ([^\\]+\\)*(.+)
FORMAT = User::"$2"


###### NTSyslog Windows Event Log ######
[force_sourcetype_for_ntsyslog_security]
DEST_KEY = MetaData:Sourcetype
REGEX = (security\[)|(\<Security)
FORMAT = sourcetype::NTSyslog:Security

[force_host_for_ntsyslog]
DEST_KEY = MetaData:Host
REGEX = \w{3}\s+\d+\s+\d+\:\d+\:\d+\s+([^\s]+)
FORMAT = host::$1

[force_source_for_ntsyslog_security]
DEST_KEY = MetaData:Source
REGEX = (security\[)|(\<Security)
FORMAT = source::NTSyslog:Security

[raw_kv_for_ntsyslog_square]
REGEX = (security)\[([^\]]+)\][\:]?\s+(\d+)\s+[^\\]+\\([^\s]+)\s+(.*)
FORMAT = action::$2 EventCode::$3 User::$4 Message::$5

[raw_kv_for_ntsyslog_angle]
REGEX = ([^\s]+)\s+NT:\s+\<(Security)\;([^;]+)\;[^\\]+\\([^\>]+)\>(.*)
FORMAT = ComputerName::$1 NTSyslogID::$3 User::$4 Message::$5

[message_kv_for_message_for_ntsyslog]
SOURCE_KEY =  Message
REGEX = (\w[\w\s\-]+)[:](.*?)(\s{2,}|\n)
FORMAT = $1::$2
MV_ADD = true

[ntsyslog_mappings]
filename = ntsyslog_mappings.csv


###### Snare Windows Event Log ######
[force_sourcetype_for_snare]
DEST_KEY = MetaData:Sourcetype
REGEX = MSWinEventLog[\t|\,][^\t\,]+[\t|\,]([^\t\,]+)[\t|\,]([^\t\,]+[\t|\,]){3}
FORMAT = sourcetype::Snare:$1

[force_host_for_snare]
DEST_KEY = MetaData:Host
REGEX = (\S+)\s+MSWinEventLog
FORMAT = host::$1

[force_source_for_snare]
DEST_KEY = MetaData:Source
REGEX = MSWinEventLog[\t|\,][^\t\,]+[\t|\,]([^\t\,]+)[\t|\,]([^\t\,]+[\t|\,]){3}
FORMAT = source::Snare:$1

# FIELDS/DELIMS extraction for tab delimitted snare data
[raw_kv_for_tab_snare]
DELIMS = "\t"
FIELDS = snare_host,snare_log_type,snare_criticality,LogName,RecordNumber,end_time,EventCode,SourceName,User,SidType,Type,ComputerName,CategoryString,DataString,Message,snare_checksum

# Message extraction for tab delimitted snare data
[Message_kv_for_tab_snare]
SOURCE_KEY = Message
REGEX = (\w[\w ]+)[:](((\x20\x20\x20\x20\x09)|(\x20\x20\x20\x20)|(\x20\x20\x20)|($))|(((\x20){1,3}(.*?))?((\x20\x20\x20\x20\x09)|(\x20\x20\x20\x20)|(\x20\x20\x20)|($))))
FORMAT = $1::$2
MV_ADD = true

# FIELDS/DELIMS extraction for comma delimitted snare data
[raw_kv_for_comma_snare]
DELIMS = ","
FIELDS = snare_log_type,snare_criticality,LogName,RecordNumber,end_time,EventCode,SourceName,User,SidType,Type,ComputerName,CategoryString,DataString,Message,snare_checksum

# Message extraction for tab delimitted snare data
[Message_kv_for_comma_snare]
SOURCE_KEY = Message
REGEX = ([\w ]+)([:](\x09){1,2}(.*?))?((\x20\x20\x20\x20\x09)|(\x20\x20\x20\x20)|($))
FORMAT = $1::$4
MV_ADD = true


###### Splunk Windows Event Log ######
## Splunk multi-line text files (.windows)
[force_sourcetype_for_windows_txt]
DEST_KEY = MetaData:Sourcetype
REGEX = Log(Name|file)=(\S+)
FORMAT = sourcetype::WinEventLog:$2

[force_sourcetype_application_sophos_for_windows_txt]
DEST_KEY = MetaData:Sourcetype
REGEX = Log(Name|file)=Application([^\r\n]*[\r\n])*SourceName=Sophos\s+Anti-Virus
FORMAT = sourcetype::WinEventLog:Application:sophos

[force_sourcetype_application_sav_for_windows_txt]
DEST_KEY = MetaData:Sourcetype
REGEX = Log(Name|file)=Application([^\r\n]*[\r\n])*SourceName=Symantec\s+AntiVirus
FORMAT = sourcetype::WinEventLog:Application:sav

[force_sourcetype_application_trendmicro_for_windows_txt]
DEST_KEY = MetaData:Sourcetype
REGEX = Log(Name|file)=Application([^\r\n]*[\r\n])*SourceName\=Trend\s+Micro\s+OfficeScan\s+Server
FORMAT = sourcetype::WinEventLog:Application:trendmicro

[force_sourcetype_system_ias_for_windows_txt]
DEST_KEY = MetaData:Sourcetype
REGEX = Log(Name|file)=System([^\r\n]*[\r\n])*SourceName=IAS
FORMAT = sourcetype::WinEventLog:System:IAS

[force_host_for_windows_txt]
DEST_KEY = MetaData:Host
REGEX = ComputerName=(\S+)
FORMAT = host::$1

[force_source_for_windows_txt]
DEST_KEY = MetaData:Source
REGEX = Log(Name|file)\=(\S+)
FORMAT = source::WinEventLog:$2

[force_source_for_wineventlog_modular]
SOURCE_KEY = MetaData:Source
DEST_KEY = MetaData:Source
REGEX = WinEventLog://(.+)
FORMAT = WinEventLog:$1

## IAS (Currently WinEventLog Support Only)
[force_sourcetype_system_ias_for_wineventlog]
DEST_KEY = MetaData:Sourcetype
REGEX = SourceName\=IAS
FORMAT = sourcetype::WinEventLog:System:IAS


###### All Windows Event Log ######

## Lookups
[windows_signature_lookup]
filename = windows_signatures.csv

[windows_signature_lookup2]
filename = windows_signatures_substatus.csv

[windows_vendor_info_lookup]
filename   = windows_vendor_info.csv
match_type = WILDCARD(sourcetype)

## REPORT
[file_path-file_name_for_windows]
SOURCE_KEY = Image_File_Name
REGEX = ^(.*[\\/]+)*(.*)$
FORMAT = file_path::$1 file_name::$2


####### Windows Security Event Log ######

## Lookups
[windows_action_lookup]
filename = windows_actions.csv

[windows_app_lookup]
filename = windows_apps.csv

[windows_audit_changes_lookup]
filename = windows_audit_changes.csv

[windows_privilege_lookup]
filename = windows_privileges.csv

## REPORT
[vendor_privilege_sv_for_windows_security]
SOURCE_KEY = Message
REGEX = (?s)^\s*(Privileges|Assigned):?\s+(.*?)(^[^:]+:)
FORMAT = vendor_privilege::$2

[vendor_privilege_mv_for_windows_security]
SOURCE_KEY = Message
REGEX = (?s)^\s*(Privileges|Assigned):\s+(.*)
FORMAT = vendor_privilege::$2

[privilege_id_for_windows_security]
SOURCE_KEY = vendor_privilege
REGEX = ^([^\r\n]+)
FORMAT = privilege_id::$1
MV_ADD = True

[Token_Elevation_Type_id_for_windows_security]
SOURCE_KEY = Token_Elevation_Type
REGEX = \((\d+)\)
FORMAT = Token_Elevation_Type_id::$1

## Aliases
[Target_Server_Name_as_dest]
SOURCE_KEY = Target_Server_Name
REGEX = ([\\]+)?([^-].*)
FORMAT = dest::"$2"

[ComputerName_as_dest]
SOURCE_KEY = ComputerName
REGEX = ([\\]+)?([^-].*)
FORMAT = dest::"$2"

[Target_Server_Name_as_dest_nt_host]
SOURCE_KEY = Target_Server_Name
REGEX = ([\\]+)?([^-].*)
FORMAT = dest_nt_host::"$2"

[ComputerName_as_dest_nt_host]
SOURCE_KEY = ComputerName
REGEX = ([\\]+)?([^-].*)
FORMAT = dest_nt_host::"$2"

[Target_Domain_as_dest_nt_domain]
SOURCE_KEY = Target_Domain
REGEX = (.+)
FORMAT = dest_nt_domain::"$1"

[Primary_Domain_as_dest_nt_domain]
SOURCE_KEY = Primary_Domain
REGEX = (.+)
FORMAT = dest_nt_domain::"$1"

[Account_Domain_as_dest_nt_domain]
SOURCE_KEY = Account_Domain
REGEX = ([^\n]+)\n(.*)
FORMAT = dest_nt_domain::"$2"

[New_Domain_as_dest_nt_domain]
SOURCE_KEY = New_Domain
REGEX = (.+)
FORMAT = dest_nt_domain::"$1"

[Domain_as_dest_nt_domain]
SOURCE_KEY = Domain
REGEX = (.+)
FORMAT = dest_nt_domain::"$1"

[Workstation_Name_as_src]
SOURCE_KEY = Workstation_Name
REGEX = ([\\]+)?([^-].*)	
FORMAT = src::"$2"

[Caller_Machine_Name_as_src]
SOURCE_KEY = Caller_Machine_Name
REGEX = ([\\]+)?([^-].*)	
FORMAT = src::"$2"

[Client_Machine_Name_as_src]
SOURCE_KEY = Client_Machine_Name
REGEX = ([\\]+)?([^-].*)	
FORMAT = src::"$2"

[Source_Network_Address_as_src]
SOURCE_KEY = Source_Network_Address
REGEX = ([\\]+)?([^-].*)
FORMAT = src::"$2"

[Client_Address_as_src]
SOURCE_KEY = Client_Address
REGEX = ([\\]+)?([^-].*)
FORMAT = src::"$2"

[ComputerName_as_src]
SOURCE_KEY = ComputerName
REGEX = ([\\]+)?([^-].*)
FORMAT = src::"$2"

[Source_Network_Address_as_src_ip]
SOURCE_KEY = Source_Network_Address
REGEX = ([\\]+)?([^-].*)
FORMAT = src_ip::"$2"

[Client_Address_as_src_ip]
SOURCE_KEY = Client_Address
REGEX = ([\\]+)?([^-].*)
FORMAT = src_ip::"$2"

[Caller_Domain_as_src_nt_domain]
SOURCE_KEY = Caller_Domain
REGEX = (.+)
FORMAT = src_nt_domain::"$1"

[Client_Domain_as_src_nt_domain]
SOURCE_KEY = Client_Domain
REGEX = (.+)
FORMAT = src_nt_domain::"$1"

[Account_Domain_as_src_nt_domain]
SOURCE_KEY = Account_Domain
REGEX = ([^\n]+)\n
FORMAT = src_nt_domain::"$1"

[Domain_as_src_nt_domain]
SOURCE_KEY = Domain
REGEX = (.+)
FORMAT = src_nt_domain::"$1"

[Workstation_Name_as_src_nt_host]
SOURCE_KEY = Workstation_Name
REGEX = ([\\]+)?([^-].*)	
FORMAT = src_nt_host::"$2"

[Caller_Machine_Name_as_src_nt_host]
SOURCE_KEY = Caller_Machine_Name
REGEX = ([\\]+)?([^-].*)	
FORMAT = src_nt_host::"$2"

[Client_Machine_Name_as_src_nt_host]
SOURCE_KEY = Client_Machine_Name
REGEX = ([\\]+)?([^-].*)	
FORMAT = src_nt_host::"$2"

[Caller_User_Name_as_src_user]
SOURCE_KEY = Caller_User_Name
REGEX = (.+)
FORMAT = src_user::"$1"

[Client_User_Name_as_src_user]
SOURCE_KEY = Client_User_Name
REGEX = (.+)
FORMAT = src_user::"$1"

[Account_Name_as_src_user]
SOURCE_KEY = Account_Name
REGEX = ([^\n]+)\n
FORMAT = src_user::"$1"

[User_Name_as_src_user]
SOURCE_KEY = User_Name
REGEX = (.+)
FORMAT = src_user::"$1"

[Target_User_Name_as_user]
SOURCE_KEY = Target_User_Name
REGEX = (.+)
FORMAT = user::"$1"

[Primary_User_Name_as_user]
SOURCE_KEY = Primary_User_Name
REGEX = (.+)
FORMAT = user::"$1"

[Target_Account_Name_as_user]
SOURCE_KEY = Target_Account_Name
REGEX = (.+)
FORMAT = user::"$1"

[New_Account_Name_as_user]
SOURCE_KEY = New_Account_Name
REGEX = (.+)
FORMAT = user::"$1"

[User_Name_as_user]
SOURCE_KEY = User_Name
REGEX = (.+)
FORMAT = user::"$1"

[Account_Name_as_user]
SOURCE_KEY = Account_Name
REGEX = ([^\n]+)\n(.*)
FORMAT = user::"$2"

[User_as_user]
SOURCE_KEY = User
REGEX = ([^\\]+\\)?(.+)
FORMAT = user::"$2"


###### Windows System Event Log ######
[signature_for_windows_system_timesync]
SOURCE_KEY = Message
REGEX = ((The\s+time\s+provider\s+\w+\s+is\s+configured\s+to\s+acquire\s+time\s+from\s+one\s+or\s+more\s+time\s+sources\,\s+however\s+none\s+of\s+the\s+sources\s+are\s+currently\s+accessible)|(The\s+time\s+service\s+is\s+now\s+synchronizing\s+the\s+system\s+time\s+with\s+the\s+time\s+source)|(Time\s+Provider\s+\w+\:\s+An\s+error\s+occurred\s+during\s+DNS\s+lookup\s+of\s+the\s+manually\s+configured\s+peer)) 
FORMAT = signature::$1

[signature_message_for_windows_system_update]
REGEX = Installation Ready: The following updates are downloaded and ready for installation.*?:\s+((?:.*[\r\n])*)
FORMAT = signature_message::$1

[signature_for_windows_system_update]
REGEX = Windows successfully installed the following update:\s+(.*)
FORMAT = signature::"$1"

[signature_for_windows_system_update2]
SOURCE_KEY = signature_message
REGEX = -\s+([^\r\n]+)
FORMAT = signature::$1
MV_ADD = True

[user_for_windows_system_ias]
REGEX = Message\=User\s+([^\/\\]+[\/\\])?([^.]+).*?was
FORMAT = user::"$2"

## IAS (Currently WinEventLog Support Only)
[auto_kv_for_windows_system_ias]
SOURCE_KEY = Message
REGEX = \n([^=\n\r\s]+)\s+\=\s+([^\n]*)
FORMAT = $1::$2
MV_ADD = TRUE


###### Update ######
[windows_update_status_lookup]
filename = windows_update_statii.csv

[signature_message_for_windowsupdatelog]
REGEX = (Content\s+Install\s+((Restart\s+Required)|(Installation\s+Ready)).*)
FORMAT = signature_message::"$1" vendor_status::"$2"

[signature_for_windowsupdatelog]
REGEX = Content\s+Install\s+(Installation\s+(Successful|Failure)):\s+Windows.*the\s+following\s+update.*?:\s+(.*)
FORMAT = vendor_status::"$1" signature::"$3"

[signature_for_windowsupdatelog_restartrequired]
REGEX = Content\s+Install\s+(Installation\s+successful\s+and\s+restart\s+required)\s+for\s+the\s+following\s+update:\s+(.*)
FORMAT = vendor_status::"$1" signature::"$2"

[signature_for_windowsupdatelog_signature_message]
SOURCE_KEY = signature_message
REGEX = \-\s+([^)]+\)(\,\s+\d+\-[bB]it\s+Edition)?)
FORMAT = signature::"$1"
MV_ADD = True

[signature_id_for_windowsupdatelog]
SOURCE_KEY = signature
REGEX = (KB\d+)
FORMAT = signature_id::$1
MV_ADD = True

[pid-tid-component_for_windowsupdatelog]
REGEX = ^\S+\s+\S+\s+(\S+)\s+(\S+)\s+(\S+)
FORMAT = pid::$1 tid::$2 component::$3


###### Endpoint Changes ######

## Endpoint Changes: lookups
[endpoint_change_status_lookup]
filename = status.csv
default_match = failure
min_matches = 1
max_matches = 1

[endpoint_change_object_category_lookup]
filename = object_category.csv

[endpoint_change_vendor_action_lookup]
filename = vendor_actions.csv

[endpoint_change_user_type_lookup]
filename = user_types.csv

## Endpoint Changes: fs_notification legacy lookups
[fs_notification_change_type_lookup]
filename = fs_notification_change_type.csv


## Endpoint Changes: fs_notification transforms
[object_object_path_for_fs_notification]
REGEX  = path=\"(\S+)(\\|/)(\S+)\"
FORMAT = object_path::$1 object::$3

[vendor_object_category_for_fs_notification]
REGEX  = isdir=(\d)
FORMAT = vendor_object_category::$1


## Endpoint Changes: WinRegistry transforms
[object_object_path_for_WinRegistry]
REGEX  = key_path=\"([^\"]+)\\([^\"]+)\"
FORMAT = object_path::$1 object::$2

[vendor_status_msg_for_WinRegistry]
REGEX  = event_status="\(([0-9-]+)\)([^\"]+)"
FORMAT = vendor_status::$1 msg::$2

# Note: user_path is not a CIM field, so we exclude it so as to avoid potential overlap.
# The commented "FORMAT" is for reference only.
[user_for_WinRegistry]
REGEX  = process_image=\"([^\"]+)\\([^\"]+)\"
FORMAT = user::$2
#FORMAT = user_path::$1 user::$2


###### Splunk Perfmon/WMI ######
[force_source_for_perfmon_txt]
SOURCE_KEY = MetaData:Source
DEST_KEY = MetaData:Source
REGEX = ([^\/\\]+)\.perfmon
FORMAT = source::Perfmon:$1

[force_sourcetype_for_perfmon_txt]
SOURCE_KEY = MetaData:Source
DEST_KEY = MetaData:Sourcetype
REGEX = ([^\/\\]+)\.perfmon
FORMAT = sourcetype::Perfmon:$1

[wmi-host]
REGEX = (?m)ComputerName=(.+)
DEST_KEY = MetaData:Host
FORMAT = host::$1

[wmi-override-host]
REGEX = (?m)wmi_hostname=(.+)
DEST_KEY = MetaData:Host
FORMAT = host::$1

[wmi-source]
REGEX = (?m)wmi_type=([^\r\n]+)
DEST_KEY = MetaData:Source
FORMAT = source::WMI:$1

[wmi-sourcetype]
REGEX = (?m)wmi_type=([^\r\n]+)
DEST_KEY = MetaData:Sourcetype
FORMAT = sourcetype::WMI:$1

[wmi-wineventlog-source]
REGEX = (?m)wmi_type=(WinEventLog:)(\S+)
DEST_KEY = MetaData:Source
FORMAT = source::$1$2

[wmi-wineventlog-sourcetype]
REGEX = (?m)wmi_type=(WinEventLog:)(\S+)
DEST_KEY = MetaData:Sourcetype
FORMAT = sourcetype::$1$2

## Installed Apps
[auto_kv_for_script_installed_apps]
REGEX = ^([^=\r\n]+)=([^\r\n]+)
FORMAT = $1::$2

## Installed Updates
[Description_for_installedupdates]
REGEX = ^Description=([^\r\n]+)
FORMAT = Description::$1

## Listening Ports
[dest_ip_for_listeningports]
REGEX = dest_ip=\[(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})
FORMAT = dest_ip::$1

[kv_for_listeningports]
DELIMS = " ", "="

## Time Configuration
[auto_kv_for_script_time_configuration]
REGEX = ^([^:\r\n]+):([^\r\n]+)$
FORMAT = $1::$2

## Time Synchronization
[auto_kv_for_script_time_synchronization]
REGEX = ^([^:\r\n]+):([^\r\n]+)$
FORMAT = $1::$2

## Version
[wmi_version_range_lookup]
filename = wmi_version_range.csv

[Caption_for_wmi_version]
REGEX = ^Caption=([^\r\n]+)
FORMAT = Caption::$1

## Set attributes for the sample data
[wmi_host_for_sample_data]
REGEX = (.+)
DEST_KEY = MetaData:Host
FORMAT = host::SJCDCSV012ERP01
