
###### Global ######

## Categories Lookup Gen disabled by default (categories are user driven)
[Identity - Make Categories - Lookup Gen]
action.email.sendresults = 0
cron_schedule            = */5 * * * *
dispatch.latest_time     = +0s
enableSched              = 0
is_visible               = false
search                   = | inputlookup categories_from_identities | inputlookup append=t categories_from_assets | `categories` | outputlookup category_lookup | stats count

## PCI Domains Lookup Gen disabled by default (PCI domains are user driven)
[Identity - Make PCI Domains - Lookup Gen]
action.email.sendresults = 0
cron_schedule            = */5 * * * *
dispatch.latest_time     = +0s
enableSched              = 0
is_visible               = false
search                   = | inputlookup pci_domains_from_assets | `pci_domains` | outputlookup pci_domains_lookup | stats count


###### Report Searches ######
[Assets - Assets By Priority]
action.email.reportServerEnabled          = 0
alert.track                               = 0
dispatch.latest_time                      = now
display.general.enablePreview             = 1
display.general.timeRangePicker.show      = false
display.general.type                      = visualizations
display.statistics.rowNumbers             = 0
display.statistics.wrap                   = 0
display.visualizations.charting.chart     = pie
display.visualizations.charting.drilldown = all
display.visualizations.show               = 1
search                                    = | pivot Identity_Management All_Assets count(All_Assets) AS "count" SPLITROW priority AS "priority" | sort - count

[Assets - Assets By Business Unit]
action.email.reportServerEnabled          = 0
alert.track                               = 0
dispatch.latest_time                      = now
display.general.enablePreview             = 1
display.general.timeRangePicker.show      = false
display.general.type                      = visualizations
display.statistics.rowNumbers             = 0
display.statistics.wrap                   = 0
display.visualizations.charting.chart     = pie
display.visualizations.charting.drilldown = all
display.visualizations.show               = 1
search                                    = | pivot Identity_Management All_Assets count(All_Assets) AS "count" SPLITROW bunit AS "bunit" | sort - count

[Assets - Assets By Category]
action.email.reportServerEnabled          = 0
alert.track                               = 0
dispatch.latest_time                      = now
display.general.enablePreview             = 1
display.general.timeRangePicker.show      = false
display.general.type                      = visualizations
display.statistics.rowNumbers             = 0
display.statistics.wrap                   = 0
display.visualizations.charting.chart     = pie
display.visualizations.charting.drilldown = all
display.visualizations.show               = 1
search                                    = | pivot Identity_Management All_Assets count(All_Assets) AS "count" SPLITROW category AS "category" | sort - count

[Assets - Asset Information]
action.email.reportServerEnabled     = 0
alert.track                          = 0
dispatch.latest_time                 = now
display.general.enablePreview        = 1
display.general.timeRangePicker.show = false
display.general.type                 = statistics
display.statistics.drilldown         = row
display.statistics.rowNumbers        = 0
display.statistics.wrap              = 0
display.visualizations.show          = 0
search                               = | `datamodel("Identity_Management", "All_Assets")` | `drop_dm_object_name("All_Assets")` | fields dns,nt_host,ip,mac,owner,priority,city,country,lat,long,bunit,category

[Identities - Identities By Priority]
action.email.reportServerEnabled          = 0
alert.track                               = 0
dispatch.latest_time                      = now
display.general.enablePreview             = 1
display.general.timeRangePicker.show      = false
display.general.type                      = visualizations
display.statistics.rowNumbers             = 0
display.statistics.wrap                   = 0
display.visualizations.charting.chart     = pie
display.visualizations.charting.drilldown = all
display.visualizations.show               = 1
search                                    = | pivot Identity_Management All_Identities count(All_Identities) AS "count" SPLITROW priority AS "priority" | sort - count

[Identities - Identities By Business Unit]
action.email.reportServerEnabled          = 0
alert.track                               = 0
dispatch.latest_time                      = now
display.general.enablePreview             = 1
display.general.timeRangePicker.show      = false
display.general.type                      = visualizations
display.statistics.rowNumbers             = 0
display.statistics.wrap                   = 0
display.visualizations.charting.chart     = pie
display.visualizations.charting.drilldown = all
display.visualizations.show               = 1
search                                    = | pivot Identity_Management All_Identities count(All_Identities) AS "count" SPLITROW bunit AS "bunit" | sort - count

[Identities - Identities By Category]
action.email.reportServerEnabled          = 0
alert.track                               = 0
dispatch.latest_time                      = now
display.general.enablePreview             = 1
display.general.timeRangePicker.show      = false
display.general.type                      = visualizations
display.statistics.rowNumbers             = 0
display.statistics.wrap                   = 0
display.visualizations.charting.chart     = pie
display.visualizations.charting.drilldown = all
display.visualizations.show               = 1
search                                    = | pivot Identity_Management All_Identities count(All_Identities) AS "count" SPLITROW category AS "category" | sort - count

[Identities - Identity Information]
action.email.reportServerEnabled     = 0
alert.track                          = 0
dispatch.latest_time                 = now
display.general.enablePreview        = 1
display.general.timeRangePicker.show = false
display.general.type                 = statistics
display.statistics.drilldown         = row
display.statistics.rowNumbers        = 0
display.statistics.wrap              = 0
display.visualizations.show          = 0
search                               = | `datamodel("Identity_Management", "All_Identities")` | `drop_dm_object_name("All_Identities")` | `uitime(startDate)` | `uitime(endDate)` | fields identity,prefix,nick,first,last,suffix,email,phone,phone2,managedBy,priority,bunit,category,watchlist,startDate,endDate

[Sessions - Network Sessions Over Time]
action.email.reportServerEnabled                    = 0
alert.track                                         = 0
dispatch.earliest_time                              = -24h@h
dispatch.latest_time                                = now
display.general.enablePreview                       = 1
display.general.type                                = visualizations
display.statistics.rowNumbers                       = 0
display.statistics.wrap                             = 0
display.visualizations.charting.chart               = line
display.visualizations.charting.chart.nullValueMode = zero
display.visualizations.charting.drilldown           = all
display.visualizations.show                         = 1
display.visualizations.type                         = charting
search                                              = | tstats `summariesonly` count from datamodel=Network_Sessions by _time,nodename span=10m | search nodename!=All_Sessions nodename!=All_Sessions.Session_* | rex field=nodename "All_Sessions.(?<session_type>.*)" | timechart minspan=10m sum(count) as count by session_type

[Sessions - Network Session Details]
action.email.reportServerEnabled     = 0
alert.track                          = 0
dispatch.earliest_time               = -24h@h
dispatch.latest_time                 = now
display.general.enablePreview        = 1
display.general.timeRangePicker.show = false
display.general.type                 = statistics
display.statistics.drilldown         = row
display.statistics.rowNumbers        = 0
display.statistics.wrap              = 0
display.visualizations.show          = 0
search                               = | datamodel Network_Sessions All_Sessions search | `drop_dm_object_name("All_Sessions")` | `unprepend_assets("dest")` | `mvappend_field(src,src_ip)` | `mvappend_field(src,src_mac)` | `mvappend_field(src,src_nt_host)` | `mvappend_field(src,src_dns)` | head 1000 | table _time,src,ip,mac,nt_host,dns,user 
