
[source::...sep]
TRANSFORMS-sub_sourcetype_sep_file =  force_sourcetype_sep_traffic, force_sourcetype_sep_proactive, force_sourcetype_sep_behavior,force_sourcetype_sep_risk,force_sourcetype_sep_admin,force_sourcetype_sep_agent,force_sourcetype_sep_policy,force_sourcetype_sep_agt_system, force_sourcetype_sep_scan,force_sourcetype_sep_security, force_sourcetype_sep_scm_system

## .tmp transforms are for file-based data
[source::...scm_admin.tmp]
sourcetype = sep:admin
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[source::...scm_agent_act.tmp]
sourcetype = sep:agent
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[source::...scm_policy.tmp]
sourcetype = sep:policy
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[source::...agt_behavior.tmp]
sourcetype = sep:behavior
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[source::...agt_proactive.tmp]
sourcetype = sep:proactive
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[source::...agt_packet.tmp]
sourcetype = sep:packet
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[source::...agt_risk.tmp]
sourcetype = sep:risk
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[source::...agt_scan.tmp]
sourcetype = sep:scan
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[source::...agt_security.tmp]
sourcetype = sep:ids
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[source::...agt_system.tmp]
sourcetype = sep:agt_system
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[source::...scm_system.tmp]
sourcetype = sep:scm_system
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[source::...agt_traffic.tmp]
sourcetype = sep:traffic
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

## sep transform is for syslog
[sep]
TRANSFORMS-sub_sourcetype_sep =  force_sourcetype_sep_traffic, force_sourcetype_sep_proactive, force_sourcetype_sep_behavior,force_sourcetype_sep_risk,force_sourcetype_sep_admin,force_sourcetype_sep_agent,force_sourcetype_sep_policy,force_sourcetype_sep_agt_system, force_sourcetype_sep_scan,force_sourcetype_sep_security, force_sourcetype_sep_scm_system


###### SEP Admin ######
[sep:admin]

KV_MODE = none
#There are few fields and they are all manually extracted anyway - not using CSV header.
## Transforms still exist though
#REPORT-0-csv_header_for_sep_admin = message_for_sep_log_files, message_for_sep_syslog
#REPORT-1-csv_header_for_sep_admin = csv_header_for_sep_admin
FIELDALIAS-bestmatch_from_dvc_for_sep_admin = dvc_nt_host as dest_nt_host, dvc_nt_host as dest, dvc_nt_host as src_nt_host, dvc_nt_host as src
REPORT-dest_nt_host_for_sep_admin = dest_nt_host_for_sep_admin
REPORT-domain_for_sep_admin = dest_nt_domain_for_sep_all
REPORT-dvc_nt_host_for_sep_admin = dvc_nt_host_for_sep_all
FIELDALIAS-name_for_sep_admin = signature as name
FIELDALIAS-src_nt_domain_for_sep_admin = dest_nt_domain as src_nt_domain
REPORT-user_for_sep_admin = user_for_sep_admin
LOOKUP-vendor_info_for_sep_admin = sep_vendor_info_lookup sourcetype OUTPUT vendor,product


###### SEP Agent ######
[sep:agent]

KV_MODE = none
REPORT-0-csv_header_for_sep_agent = message_for_sep_log_files, message_for_sep_syslog
REPORT-1-csv_header_for_sep_agent = csv_header_for_sep_agent
FIELDALIAS-dest_for_sep_agent = dest_nt_host as dest, dest_nt_host as src_nt_host, dest_nt_host as src
FIELDALIAS-dvc_for_sep_agent = dvc_nt_host as dvc
REPORT-dvc_nt_host_for_sep_agent = dvc_nt_host_for_sep_all
FIELDALIAS-src_nt_domain_for_sep_agent = dest_nt_domain as src_nt_domain
LOOKUP-vendor_info_for_sep_agent = sep_vendor_info_lookup sourcetype OUTPUT vendor,product


###### SEP AGT System ######
[sep:agt_system]

KV_MODE = none
REPORT-0-csv_header_for_sep_agt_system = message_for_sep_log_files, message_for_sep_syslog
REPORT-1-csv_header_for_sep_agt_system = csv_header_for_sep_agt_system
FIELDALIAS-bestmatch_for_sep_agt_system = dest_nt_host as dest, dest_nt_host as src_nt_host, dest_nt_host as src
FIELDALIAS-dvc_for_sep_agt_system = dvc_ip as dvc
REPORT-name_dvc_ip_for_sep_agt_system = name_dvc_ip_for_sep_agt_system
REPORT-product_version_for_sep_agt_system = product_version_for_sep_agt_system
REPORT-sig_version_for_sep_agt_system = sig_version_for_sep_agt_system
LOOKUP-vendor_info_for_sep_agt_system= sep_vendor_info_lookup sourcetype OUTPUT vendor,product


###### SEP Behavior ######
[sep:behavior]

KV_MODE = none
REPORT-0-csv_header_for_sep_behavior = message_for_sep_log_files, message_for_sep_syslog
REPORT-1-csv_header_for_sep_behavior = csv_header_for_sep_behavior
REPORT-dest_nt_domain_for_sep_behavior = dest_nt_domain_for_sep_all
REPORT-file_name_path_for_sep_behavior = file_name_path_for_sep_behavior
REPORT-signature_for_sep_behavior = signature_for_sep_behavior
FIELDALIAS-src_nt_domain_for_sep_behavior = dest_nt_domain as src_nt_domain
FIELDALIAS-src_nt_host_for_sep_behavior = dest_nt_host as dest, dest_nt_host as src_nt_host, dest_nt_host as src
REPORT-user_for_sep_behavior = user_for_sep_all
LOOKUP-vendor_info_for_sep_behavior = sep_vendor_info_lookup sourcetype OUTPUT vendor,product,ids_type


###### SEP IDS ######
[sep:ids]

KV_MODE = none
REPORT-0-csv_header_for_sep_security = message_for_sep_log_files, message_for_sep_syslog
REPORT-1-csv_header_for_sep_security = csv_header_for_sep_security
REPORT-addresses_inbound_outbound_for_sep_security = src_dest_addr_inbound_for_sep_security, src_dest_addr_outbound_for_sep_security
REPORT-action_for_sep_security = action_for_sep_security
REPORT-application_file_for_sep_security = application_file_for_sep_security
FIELDALIAS-bestmatch_for_sep_security = dest_nt_host as dest, dest_nt_host as src_nt_host, dest_nt_host as src
REPORT-dest_nt_domain_for_sep_security = dest_nt_domain_for_sep_all
REPORT-signature_for_sep_security = sep_name_as_signature
FIELDALIAS-src_domain_for_sep_security = dest_nt_domain as src_nt_domain
REPORT-user_for_sep_security = user_for_sep_all
LOOKUP-vendor_info_for_sep_security = sep_vendor_info_lookup sourcetype OUTPUT vendor,product,ids_type


###### SEP Policy ######
[sep:policy]
KV_MODE = none

REPORT-0-csv_header_for_sep_policy = message_for_sep_log_files, message_for_sep_syslog
REPORT-1-csv_header_for_sep_policy = csv_header_for_sep_policy
REPORT-vendor_action_success_for_sep_policy = vendor_action_success_for_sep_policy
FIELDALIAS-bestmatch_from_dvc_for_sep_policy = dvc_nt_host as dest_nt_host, dvc_nt_host as dest, dvc_nt_host as src_nt_host, dvc_nt_host as src
REPORT-command_for_sep_policy = command_for_sep_policy
REPORT-dest_nt_domain_for_sep_policy = dest_nt_domain_for_sep_all
REPORT-dvc_nt_host_for_sep_policy = dvc_nt_host_for_sep_all
FIELDALIAS-src_nt_domain_for_sep_policy = dest_nt_domain as src_nt_domain
REPORT-user_for_sep_policy = user_for_sep_policy
LOOKUP-vendor_info_for_sep_policy = sep_vendor_info_lookup sourcetype OUTPUT vendor,product


###### SEP Proactive ######
[sep:proactive]

KV_MODE = none
REPORT-0-csv_header_for_sep_proactive = message_for_sep_log_files, message_for_sep_syslog
REPORT-1-csv_header_for_sep_proactive = csv_header_for_sep_proactive
LOOKUP-action_for_sep_proactive = sep_action_lookup action_taken OUTPUT action
REPORT-action_taken_for_sep_proactive = action_taken_for_sep_risk
REPORT-application_name_for_sep_proactive = application_name_for_sep_proactive
REPORT-application_type_for_sep_proactive = application_type_for_sep_proactive
FIELDALIAS-bestmatch_for_sep_proactive = dest_nt_host as dest, dest_nt_host as src_nt_host, dest_nt_host as src
REPORT-dest_nt_host_for_sep_proactive = dest_nt_host_for_sep_all
REPORT-requested_action_for_sep_proactive = requested_action_for_sep_risk
REPORT-secondary_action_for_sep_proactive = secondary_action_for_sep_risk
REPORT-user_for_sep_proactive = user_for_sep_all
LOOKUP-vendor_info_for_sep_proactive = sep_vendor_info_lookup sourcetype OUTPUT vendor,product


###### SEP Risk ######
[sep:risk]

KV_MODE = none
REPORT-0-csv_header_for_sep_risk = message_for_sep_log_files, message_for_sep_syslog
REPORT-1-csv_header_for_sep_risk = csv_header_for_sep_risk
LOOKUP-action_for_sep_risk = sep_action_lookup action_taken OUTPUTNEW action
REPORT-action_taken_for_sep_risk = action_taken_for_sep_risk
FIELDALIAS-bestmatch_for_sep_risk = dest_nt_host as dest, dest_nt_host as src_nt_host, dest_nt_host as src
REPORT-dest_nt_host_for_sep_risk = dest_nt_host_for_sep_all
REPORT-file_name_path_for_sep_risk = file_name_path_for_sep_risk
REPORT-signature_for_sep_risk = signature_for_sep_risk
REPORT-user_for_sep_risk = user_for_sep_all
REPORT-requested_action_for_sep_risk = requested_action_for_sep_risk
REPORT-secondary_action_for_sep_risk = secondary_action_for_sep_risk	
LOOKUP-vendor_info_for_sep_risk = sep_vendor_info_lookup sourcetype OUTPUT vendor,product


###### SEP Scan ######
[sep:scan]

KV_MODE = none
REPORT-0-csv_header_for_sep_scan = message_for_sep_log_files, message_for_sep_syslog
REPORT-1-csv_header_for_sep_scan = csv_header_for_sep_scan
FIELDALIAS-bestmatch_for_sep_scan = dest_nt_host as dest, dest_nt_host as src_nt_host, dest_nt_host as src
REPORT-counts_for_sep_scan = infected_count_for_sep_scan, threat_count_for_sep_scan
REPORT-dest_nt_host_for_sep_scan = dest_nt_host_for_sep_scan
REPORT-dest_ip_for_sep_scan = dest_ip_for_sep_scan
REPORT-dest_nt_domain_for_sep_scan = dest_nt_domain_for_sep_all
REPORT-duration_for_sep_scan = duration_for_sep_scan
FIELDALIAS-src_nt_domain_for_sep_scan = dest_nt_domain as src_nt_domain
FIELDALIAS-src_ip_for_sep_scan = dest_ip as src_ip
LOOKUP-vendor_info_for_sep_scan = sep_vendor_info_lookup sourcetype OUTPUT vendor,product

REPORT-Xdest_ip_for_sep_scan = dest_ip_for_sep_scan
REPORT-Xuser_for_sep_scan = user_for_sep_scan 


###### SEP SCM System ######
[sep:scm_system]

KV_MODE = none
REPORT-0-csv_header_for_sep_scm_system = message_for_sep_log_files, message_for_sep_syslog
REPORT-1-csv_header_for_sep_scm_system = csv_header_for_sep_scm_system
FIELDALIAS-dvc_for_sep_scm_system = dvc_nt_host as dvc
REPORT-dvc_nt_host_for_sep_scm_system = dvc_nt_host_for_sep_all
LOOKUP-vendor_info_for_sep_scm_system = sep_vendor_info_lookup sourcetype OUTPUT vendor,product
REPORT-version_for_sep_scm_system = version_for_sep_scm_system


###### SEP Traffic ######
[sep:traffic]

KV_MODE = none
REPORT-0-csv_header_for_sep_traffic = message_for_sep_log_files, message_for_sep_syslog
REPORT-1-csv_header_for_sep_traffic = csv_header_for_sep_traffic
LOOKUP-action_for_sep_traffic = sep_action_lookup vendor_action OUTPUTNEW action
REPORT-vendor_action_for_sep_traffic = vendor_action_for_sep_traffic
REPORT-addresses_for_sep_traffic = inbound_addresses_for_sep_traffic, outbound_addresses_for_sep_traffic
FIELDALIAS-dest_for_sep_traffic = dest_nt_host as dest
LOOKUP-direction_for_sep_traffic = sep_direction_lookup vendor_direction OUTPUTNEW direction
REPORT-nt_host_for_sep_traffic = dest_nt_host_inbound_for_sep_traffic, src_nt_host_outbound_for_sep_traffic
FIELDALIAS-src_for_sep_traffic = src_nt_host as src
REPORT-user_for_sep_traffic = user_for_sep_all
LOOKUP-vendor_info_for_sep_traffic = sep_vendor_info_lookup sourcetype OUTPUT vendor,product
