
###### assetLookup ######
# Multiple lookups for each input field: by IP for CIDR-based lookups and then by mac, dns, nt_host
# As the key will either be an IP or a text field, only one lookup will succeed.

# Set boolean gates for default field lookups
# - 1 indicates a lookup is required
# - "host" is always present
EVAL-idm_flags=if(isnull(orig_host), "0", "1").if(isnull(src), "0", "1").if(isnull(dest), "0", "1").if(isnull(dvc), "0", "1").if(isnull(src_user), "0", "1").if(isnull(user), "0", "1")

# Perform lookups on all key fields - ip, mac, dns, nt_host - in that order.
LOOKUP-zu_asset_lookup_host_as_str_only = asset_lookup_by_str key as host OUTPUTNEW asset_id as host_asset_id,ip as host_ip,mac as host_mac,nt_host as host_nt_host,dns as host_dns,owner as host_owner,priority as host_priority,lat as host_lat,long as host_long,city as host_city,country as host_country,bunit as host_bunit,category as host_category,pci_domain as host_pci_domain,is_expected as host_is_expected,should_timesync as host_should_timesync,should_update as host_should_update,requires_av as host_requires_av,asset_tag as host_asset_tag
LOOKUP-zv_asset_lookup_host_as_cidr_only = asset_lookup_by_cidr key as host OUTPUTNEW asset_id as host_asset_id,ip as host_ip,mac as host_mac,nt_host as host_nt_host,dns as host_dns,owner as host_owner,priority as host_priority,lat as host_lat,long as host_long,city as host_city,country as host_country,bunit as host_bunit,category as host_category,pci_domain as host_pci_domain,is_expected as host_is_expected,should_timesync as host_should_timesync,should_update as host_should_update,requires_av as host_requires_av,asset_tag as host_asset_tag

LOOKUP-zu_asset_lookup_orig_host_as_str_only = asset_lookup_by_str key as orig_host OUTPUTNEW asset_id as orig_host_asset_id,ip as orig_host_ip,mac as orig_host_mac,nt_host as orig_host_nt_host,dns as orig_host_dns,owner as orig_host_owner,priority as orig_host_priority,lat as orig_host_lat,long as orig_host_long,city as orig_host_city,country as orig_host_country,bunit as orig_host_bunit,category as orig_host_category,pci_domain as orig_host_pci_domain,is_expected as orig_host_is_expected,should_timesync as orig_host_should_timesync,should_update as orig_host_should_update,requires_av as orig_host_requires_av,asset_tag as orig_host_asset_tag
LOOKUP-zv_asset_lookup_orig_host_as_cidr_only = asset_lookup_by_cidr key as orig_host OUTPUTNEW asset_id as orig_host_asset_id,mac as orig_host_mac,nt_host as orig_host_nt_host,dns as orig_host_dns,owner as orig_host_owner,priority as orig_host_priority,lat as orig_host_lat,long as orig_host_long,city as orig_host_city,country as orig_host_country,bunit as orig_host_bunit,category as orig_host_category,pci_domain as orig_host_pci_domain,is_expected as orig_host_is_expected,should_timesync as orig_host_should_timesync,should_update as orig_host_should_update,requires_av as orig_host_requires_av,asset_tag as orig_host_asset_tag

LOOKUP-zu_asset_lookup_src_as_str_only = asset_lookup_by_str key as src OUTPUTNEW asset_id as src_asset_id,ip as src_ip,mac as src_mac,nt_host as src_nt_host,dns as src_dns,owner as src_owner,priority as src_priority,lat as src_lat,long as src_long,city as src_city,country as src_country,bunit as src_bunit,category as src_category,pci_domain as src_pci_domain,is_expected as src_is_expected,should_timesync as src_should_timesync,should_update as src_should_update,requires_av as src_requires_av,asset_tag as src_asset_tag
LOOKUP-zv_asset_lookup_src_as_cidr_only = asset_lookup_by_cidr key as src OUTPUTNEW asset_id as src_asset_id,mac as src_mac,nt_host as src_nt_host,dns as src_dns,owner as src_owner,priority as src_priority,lat as src_lat,long as src_long,city as src_city,country as src_country,bunit as src_bunit,category as src_category,pci_domain as src_pci_domain,is_expected as src_is_expected,should_timesync as src_should_timesync,should_update as src_should_update,requires_av as src_requires_av,asset_tag as src_asset_tag

LOOKUP-zu_asset_lookup_dest_as_str_only = asset_lookup_by_str key as dest OUTPUTNEW asset_id as dest_asset_id,ip as dest_ip,mac as dest_mac,nt_host as dest_nt_host,dns as dest_dns,owner as dest_owner,priority as dest_priority,lat as dest_lat,long as dest_long,city as dest_city,country as dest_country,bunit as dest_bunit,category as dest_category,pci_domain as dest_pci_domain,is_expected as dest_is_expected,should_timesync as dest_should_timesync,should_update as dest_should_update,requires_av as dest_requires_av,asset_tag as dest_asset_tag
LOOKUP-zv_asset_lookup_dest_as_cidr_only = asset_lookup_by_cidr key as dest OUTPUTNEW asset_id as dest_asset_id,mac as dest_mac,nt_host as dest_nt_host,dns as dest_dns,owner as dest_owner,priority as dest_priority,lat as dest_lat,long as dest_long,city as dest_city,country as dest_country,bunit as dest_bunit,category as dest_category,pci_domain as dest_pci_domain,is_expected as dest_is_expected,should_timesync as dest_should_timesync,should_update as dest_should_update,requires_av as dest_requires_av,asset_tag as dest_asset_tag

LOOKUP-zu_asset_lookup_dvc_as_str_only = asset_lookup_by_str key as dvc OUTPUTNEW asset_id as dvc_asset_id,ip as dvc_ip,mac as dvc_mac,nt_host as dvc_nt_host,dns as dvc_dns,owner as dvc_owner,priority as dvc_priority,lat as dvc_lat,long as dvc_long,city as dvc_city,country as dvc_country,bunit as dvc_bunit,category as dvc_category,pci_domain as dvc_pci_domain,is_expected as dvc_is_expected,should_timesync as dvc_should_timesync,should_update as dvc_should_update,requires_av as dvc_requires_av,asset_tag as dvc_asset_tag
LOOKUP-zv_asset_lookup_dvc_as_cidr_only = asset_lookup_by_cidr key as dvc OUTPUTNEW asset_id as dvc_asset_id,mac as dvc_mac,nt_host as dvc_nt_host,dns as dvc_dns,owner as dvc_owner,priority as dvc_priority,lat as dvc_lat,long as dvc_long,city as dvc_city,country as dvc_country,bunit as dvc_bunit,category as dvc_category,pci_domain as dvc_pci_domain,is_expected as dvc_is_expected,should_timesync as dvc_should_timesync,should_update as dvc_should_update,requires_av as dvc_requires_av,asset_tag as dvc_asset_tag

###### identityLookup ######

## username fields
LOOKUP-zy_identity_lookup_src_user_only = identity_lookup_expanded key as src_user OUTPUTNEW identity as src_user_identity,prefix as src_user_prefix,nick as src_user_nick,first as src_user_first,last as src_user_last,suffix as src_user_suffix,email as src_user_email,phone as src_user_phone,phone2 as src_user_phone2,managedBy as src_user_managedBy,priority as src_user_priority,bunit as src_user_bunit,category as src_user_category,watchlist as src_user_watchlist,startDate as src_user_startDate,endDate as src_user_endDate,identity_tag as src_user_identity_tag
LOOKUP-zy_identity_lookup_user_only = identity_lookup_expanded key as user OUTPUTNEW identity as user_identity,prefix as user_prefix,nick as user_nick,first as user_first,last as user_last,suffix as user_suffix,email as user_email,phone as user_phone,phone2 as user_phone2,managedBy as user_managedBy,priority as user_priority,bunit as user_bunit,category as user_category,watchlist as user_watchlist,startDate as user_startDate,endDate as user_endDate,identity_tag as user_identity_tag

# Default field lookups: These set default values for certain fields and are 
# intentionally named so that they get executed after the preceding lookups.
LOOKUP-zz-asset_identity_lookup_default_fields = asset_identity_lookup_default_fields flags as idm_flags OUTPUTNEW


## _internal logging
[source::...identityLookup_base_class.log]
sourcetype = identityLookup:base_class

[source::...identityLookup_rest_handler.log]
sourcetype = identityLookup:rest_handler

[source::...identityLookup_reload.log]
sourcetype = identityLookup:reload

[source::...identityLookup.log]
sourcetype = identityLookup:lookup
