
###### WinEventLog Sophos ######
[source::....winsophos]
TRANSFORMS-force_source_for_wineventlog_application_sophos = force_source_for_wineventlog_application_sophos
sourcetype = WinEventLog:Application:sophos

[source::WinEventLog:Application]
TRANSFORMS-force_sourcetype_for_wineventlog_application_sophos = force_sourcetype_for_wineventlog_application_sophos

[WinEventLog:Application:sophos]
REPORT-vendor_action_for_wineventlog_application_sophos = vendor_action_for_wineventlog_application_sophos
LOOKUP-action_for_wineventlog_application_sophos = sophos_action_lookup vendor_action OUTPUT action
FIELDALIAS-category_for_wineventlog_application_sophos = CategoryString as category
FIELDALIAS-dest_for_wineventlog_application_sophos = ComputerName as dest
REPORT-file_name-file_path_for_wineventlog_application_sophos = file_name-file_path_for_wineventlog_application_sophos
REPORT-signature_for_wineventlog_application_sophos = signature_for_wineventlog_application_sophos
FIELDALIAS-user_for_wineventlog_application_sophos = User as user
LOOKUP-vendor_info_for_wineventlog_application_sophos = sophos_vendor_info_lookup SourceName OUTPUT vendor,product


###### Sophos Endpoint Protection and Sophos UTM ######

## INPUT-time settings - this TA is required on the SEC forwarder! ##
################################################################################

## Threats.sophos ##
[source::...Threats.sophos]
sourcetype = sophos:threats

## WebData.sophos ##
[source::...WebData.sophos]
sourcetype = sophos:webdata

## Firewall.sophos ##
[source::...Firewall.sophos]
sourcetype = sophos:firewall

## AppControl.sophos ##
[source::...AppControl.sophos]
sourcetype = sophos:appcontrol

## DeviceControl.sophos ##
[source::...DeviceControl.sophos]
sourcetype = sophos:devicecontrol

## TamperProtection.sophos ##
[source::...TamperProtection.sophos]
sourcetype = sophos:tamperprotection

## DataControl.sophos
[source::...DataControl.sophos]
sourcetype = sophos:datacontrol

## ComputerData.sophos
[source::...ComputerData.sophos]
sourcetype = sophos:computerdata




## Index-time settings ##
################################################################################
# Syslog-based
# apply these to your input data sourcetype or source
#TRANSFORMS-sophos_utm_fw_st = force_sourcetype_for_utm_firewall
#TRANSFORMS-sophos_utm_ips_st = force_sourcetype_for_utm_ips
#TRANSFORMS-sophos_utm_ipsec_st = force_sourcetype_for_utm_ipsec


# File-based
[sophos:threats]
TIME_PREFIX = EventTime="
TIME_FORMAT = %Y-%m-%d %H:%M:%S
MAX_TIMESTAMP_LOOKAHEAD = 25

[sophos:webdata]
TIME_PREFIX = EventTime="
TIME_FORMAT = %Y-%m-%d %H:%M:%S
MAX_TIMESTAMP_LOOKAHEAD = 25

[sophos:firewall]
TIME_PREFIX = EventTime="
TIME_FORMAT = %Y-%m-%d %H:%M:%S
MAX_TIMESTAMP_LOOKAHEAD = 25

[sophos:appcontrol]
TIME_PREFIX = EventTime="
TIME_FORMAT = %Y-%m-%d %H:%M:%S
MAX_TIMESTAMP_LOOKAHEAD = 25

[sophos:devicecontrol]
TIME_PREFIX = EventTime="
TIME_FORMAT = %Y-%m-%d %H:%M:%S
MAX_TIMESTAMP_LOOKAHEAD = 25

[sophos:tamperprotection]
TIME_PREFIX = EventTime="
TIME_FORMAT = %Y-%m-%d %H:%M:%S
MAX_TIMESTAMP_LOOKAHEAD = 25

[sophos:datacontrol]
TIME_PREFIX = EventTime="
TIME_FORMAT = %Y-%m-%d %H:%M:%S
MAX_TIMESTAMP_LOOKAHEAD = 25

[sophos:computerdata]
TIME_PREFIX = EventTime="
TIME_FORMAT = %Y-%m-%d %H:%M:%S
MAX_TIMESTAMP_LOOKAHEAD = 25

LOOKUP-vendor_info_for_sophos_computerdata = sophos_vendor_info_lookup sourcetype OUTPUTNEW vendor,product


## Search-time settings ##
################################################################################

# File-based
[sophos:threats]
REPORT-sophos-threat-file-path_and-file-name = sophos_threat_file_path_and_file_name
FIELDALIAS-event_id_for_threat = EventID as event_id
FIELDALIAS-category_for_threat = EventType as category
FIELDALIAS-dest_for_threat = ComputerName as dest
FIELDALIAS-nt_domain_for_threat = ComputerDomain as dest_nt_domain
FIELDALIAS-dest_ip_for_threat = ComputerIPAddress as dest_ip
FIELDALIAS-user_for_threat = UserName as user
FIELDALIAS-signature_for_threat = EventName as signature
LOOKUP-action_for_threat = sophos_threat_action Action OUTPUTNEW action
LOOKUP-vendor_info_for_sophos_threats = sophos_vendor_info_lookup sourcetype OUTPUTNEW vendor,product

[sophos:webdata]
FIELDALIAS-event_id_for_webdata = EventID as event_id
FIELDALIAS-nt_domain_for_webdata = ComputerDomain as dest_nt_domain
FIELDALIAS-action_for_webdata = Action as action
FIELDALIAS-src_for_webdata = ComputerName as src
FIELDALIAS-src_ip_for_webdata = ComputerIPAddress as src_ip
FIELDALIAS-http_refer_for_webdata = ReferringURL as http_refer
FIELDALIAS-url_for_webdata = FullFilePath as url
LOOKUP-vendor_info_for_sophos_webdata = sophos_vendor_info_lookup sourcetype OUTPUTNEW vendor,product

[sophos:firewall]
FIELDALIAS-event_id_for_firewall = EventID as event_id
FIELDALIAS-nt_domain_for_firewall = ComputerDomain as nt_domain
FIELDALIAS-dvc_for_firewall = ComputerIPAddress as dvc
FIELDALIAS-user_for_firewall = UserName as user
FIELDALIAS-transport_for_firewall = Protocol as transport
FIELDALIAS-src_for_firewall = LocalAddress as src
FIELDALIAS-dest_for_firewall = RemoteAddress as dest
FIELDALIAS-src_port_for_firewall = LocalPort as src_port
FIELDALIAS-dest_port_for_firewall = RemotePort as dest_port
LOOKUP-action_for_firewall = sophos_action_for_firewall Action OUTPUTNEW action
LOOKUP-vendor_info_for_sophos_firewall = sophos_vendor_info_lookup sourcetype OUTPUTNEW vendor,product

[sophos:appcontrol]
FIELDALIAS-event_id_for_appcontrol = EventID as event_id
FIELDALIAS-dest_for_appcontrol = ComputerName as dest, ComputerIPAddress as dest 
FIELDALIAS-dest_ip_for_appcontrol = ComputerIPAddress as dest
FIELDALIAS-dest_host_for_appcontrol = ComputerName as dest_host
FIELDALIAS-nt_domain_for_appcontrol = ComputerDomain as nt_domain
FIELDALIAS-app_for_appcontrol = EventName as app, Name as app
FIELDALIAS-category_for_appcontrol = SubType as category
FIELDALIAS-user_for_appcontrol = UserName as user
FIELDALIAS-action_for_appcontrol = Action as action
LOOKUP-vendor_info_for_sophos_appcontrol = sophos_vendor_info_lookup sourcetype OUTPUTNEW vendor,product

[sophos:devicecontrol]
FIELDALIAS-event_id_for_devicecontrol = EventID as event_id
FIELDALIAS-dest_for_devicecontrol = ComputerName as dest, ComputerIPAddress as dest 
FIELDALIAS-dest_ip_for_devicecontrol = ComputerIPAddress as dest_ip
FIELDALIAS-dest_host_for_devicecontrol = ComputerName as dest
FIELDALIAS-nt_domain_for_devicecontrol = ComputerDomain as nt_domain
FIELDALIAS-device_for_devicecontrol = Model as device
FIELDALIAS-device_id_for_devicecontrol = DeviceID as device_id
FIELDALIAS-device_type_for_devicecontrol = Model as device_type
FIELDALIAS-category_for_devicecontrol = DeviceType as category
FIELDALIAS-user_for_devicecontrol = UserName as user
FIELDALIAS-action_for_devicecontrol = Action as action
LOOKUP-vendor_info_for_sophos_devicecontrol = sophos_vendor_info_lookup sourcetype OUTPUTNEW vendor,product

[sophos:tamperprotection]
FIELDALIAS-event_id_for_tamperprotection = EventID as event_id
FIELDALIAS-dest_for_tamperprotection = ComputerName as dest, ComputerIPAddress as dest
FIELDALIAS-dest_ip_for_tamperprotection = ComputerIPAddress as dest_ip
FIELDALIAS-dest_host_for_tamperprotection = ComputerName as dest_host
FIELDALIAS-nt_domain_for_tamperprotection = ComputerDomain as nt_domain
FIELDALIAS-user_for_tamperprotection = UserName as user
FIELDALIAS-action_for_tamperprotection = SubType as vendor_action
LOOKUP-vendor_info_for_sophos_tamperprotection = sophos_vendor_info_lookup sourcetype OUTPUTNEW vendor,product
## TamperProtect applies changes the Endpoint Protection
LOOKUP-action_for_sophos_tamperprotection = sophos_action_lookup vendor_action AS SubType OUTPUTNEW action,action AS result
LOOKUP-object_for_sophos_tamperprotection = sophos_vendor_info_lookup sourcetype OUTPUTNEW product as object

[sophos:computerdata]
FIELDALIAS-event_id_for_computerdata = EventID as event_id
FIELDALIAS-dest_for_computerdata = ComputerIPAddress as dest, ComputerName as dest
FIELDALIAS-dest_ip_for_computerdata = ComputerIPAddress as dest_ip
FIELDALIAS-dest_host_for_computerdata = ComputerName as dest_host
FIELDALIAS-nt_domain_for_computerdata = ComputerDomain as dest_nt_domain
FIELDALIAS-os_for_computerdata = ComputerOperatingSystem as os
REPORT-product_version_for_computerdata = SAVVersion_as_product_version
FIELDALIAS-engine_version_for_computerdata = EngineVersion as engine_version
FIELDALIAS-signature_version_for_computerdata = VirusDataVersion as signature_version
LOOKUP-vendor_info_for_sophos_computerdata = sophos_vendor_info_lookup sourcetype OUTPUTNEW vendor,product


[sophos:sec]
FIELDALIAS-dest_for_sec = ComputerName as dest, RemoteAddress as dest
FIELDALIAS-dest_host_for_sec = ComputerName as dest_host, RemoteAddress as dest_host
FIELDALIAS-dest_ip_for_sec = ComputerIPAddress as dest_ip, RemoteAddress as dest_ip
FIELDALIAS-action_for_av = Action as action
FIELDALIAS-signature_for_av = EventName as signature
FIELDALIAS-dest_nt_domain_for_av = ComputerDomain as dest_nt_domain
FIELDALIAS-transport_for_fw = Protocol as transport
FIELDALIAS-dvc_for_fw = ComputerName as dvc
FIELDALIAS-dvc_host_for_fw = ComputerName as dvc_host
FIELDALIAS-dvc_ip_for_fw = ComputerIPAddress as dvc_ip
FIELDALIAS-dest_port_for_fw = RemotePort as dest_port
FIELDALIAS-src_for_fw = LocalAddress as src
FIELDALIAS-src_ip_for_fw = LocalAddress as src_ip
FIELDALIAS-src_port_for_fw = LocalPort as src_port
FIELDALIAS-user_for_fw = UserName as user
LOOKUP-vendor_product_for_sec = sophos_vendor_info_lookup source OUTPUTNEW vendor, product


[sophos:swa]
FIELDALIAS-bytes_in_for_swa = in AS bytes_in
FIELDALIAS-bytes_out_for_swa = out AS bytes_out
#FIELDALIAS-dest_for_swa = dom AS dest
FIELDALIAS-dest_host_for_swa = dom AS dest_host
FIELDALIAS-dest_ip_for_swa = target_ip AS dest_ip
FIELDALIAS-http_content_type_for_swa = type AS http_content_type
FIELDALIAS-http_method_for_swa = meth AS http_method
FIELDALIAS-http_refer_for_swa = ref AS http_refer
FIELDALIAS-http_user_agent_for_swa = ua AS http_user_agent
FIELDALIAS-signature_for_swa = threat AS signature
#h has a colon at the end, strip with a REPORT
#FIELDALIAS-src_for_swa = h AS src
FIELDALIAS-status_for_swa = s AS status
FIELDALIAS-user_for_swa = u AS user
REPORT-url_for_swa = url_for_swa
REPORT-split_swa_cat = split_swa_cat
# pull dest from dom if threat="-", otherwise h
REPORT-dest_for_swa_proxy_av = dest_for_swa_proxy, dest_for_swa_av
REPORT-src_for_swa_proxy = src_for_swa_proxy
LOOKUP-action_for_swa = sophos_swa_actions act OUTPUT action
LOOKUP-vendor_product_for_swa = sophos_vendor_info_lookup source OUTPUTNEW vendor, product
LOOKUP-risk_levels_for_swa = sophos_risk_levels risk_id OUTPUTNEW risk
LOOKUP-categories_for_swa = sophos_swa_categories category_id OUTPUTNEW category
LOOKUP-block_reasons_for_swa = sophos_swa_block rsn OUTPUTNEW block_reason


[sophos:utm:firewall]
FIELDALIAS-dest_for_utm_fw = dstip AS dest
FIELDALIAS-dest_ip_for_utm_fw = dstip AS dest_ip
FIELDALIAS-dest_port_for_utm_fw = dstport AS dest_port
FIELDALIAS-dvc_for_utm_fw = host AS dvc
FIELDALIAS-src_for_utm_fw = srcip AS src
FIELDALIAS-src_ip_for_utm_fw = srcip AS src_ip
FIELDALIAS-src_port_for_utm_fw = srcport AS src_port
LOOKUP-transport_for_utm_fw = ip_protocols proto OUTPUT transport
LOOKUP-vendor_product_for_utm_fw = sophos_vendor_info_lookup sourcetype OUTPUTNEW vendor, product

[sophos:utm:ips]
FIELDALIAS-category_for_ips = class as category
FIELDALIAS-dest_for_ips = dstip as dest
FIELDALIAS-dest_ip_for_ips = dstip as dest_ip
FIELDALIAS-dest_port_for_ips = dstport as dest_port
FIELDALIAS-dvc_for_ips = host as dvc
REPORT-pid_for_ips = pid_for_ips
LOOKUP-severity_for_ips = sophos_ips_severity_lookup priority OUTPUT severity
FIELDALIAS-signature_for_ips = reason as signature
FIELDALIAS-src_for_ips = srcip as src
FIELDALIAS-src_ip_for_ips = srcip as src_ip
FIELDALIAS-src_port_for_ips = srcport as src_port
LOOKUP-transport_for_ips = ip_protocols proto OUTPUT transport
LOOKUP-vendor_product_for_ips = sophos_vendor_info_lookup sourcetype OUTPUTNEW vendor, product

[sophos:utm:ipsec]
LOOKUP-action_for_ipsec = sophos_ipsec_actions id OUTPUTNEW action
FIELDALIAS-app_for_ipsec = variant AS app
FIELDALIAS-src_for_ipsec = srcip AS src
FIELDALIAS-src_user_for_ipsec = username AS src_user
FIELDALIAS-dest_for_ipsec = virtual_ip AS dest
FIELDALIAS-dest_ip_for_ipsec = virtual_ip AS dest_ip
FIELDALIAS-user_for_ipsec = username AS user
REPORT-pid_for_ipsec = pid_for_ips
FIELDALIAS-key_for_ipsec = dest AS key
LOOKUP-vendor_product_for_ipsec = sophos_vendor_info_lookup sourcetype OUTPUTNEW vendor, product
