
###### Correlation Searches ######
[Threat - Same Error On Many Systems - Rule]
action.email.sendresults   = 0
action.summary_index       = 1
action.summary_index._name = notable
action.summary_index.ttl   = 1p
alert.digest_mode          = 1
alert.suppress             = 1
alert.suppress.fields      = sourcetype
alert.suppress.period      = 86300
alert.track                = false
cron_schedule              = 40 * * * *
disabled                   = True
dispatch.earliest_time     = -65m@m
dispatch.latest_time       = -5m@m
enableSched                = 1
is_visible                 = false
search                     = tag=error NOT tag=authentication | stats first(_raw) as orig_raw,dc(host) as system_count by sourcetype,punct | where 'system_count'>100 | `map_notable_fields`

[Threat - Threat List Activity - Rule]
action.email.sendresults      = 0
action.risk                   = 1
action.risk._risk_object_type = system
action.risk._risk_score       = 40
action.summary_index          = 1
action.summary_index._name    = notable
action.summary_index.ttl      = 1p
alert.digest_mode             = 1
alert.suppress                = 1
alert.suppress.fields         = sourcetype,src,dest,url
alert.suppress.period         = 86300
alert.track                   = false
cron_schedule                 = 10 * * * *
disabled                      = True
dispatch.earliest_time        = -65m@m
dispatch.latest_time          = -5m@m
enableSched                   = 1
is_visible                    = false
search                        = | `src_dest_tracker("allowed")` | `tstats` append=true count,values(sourcetype) from datamodel=Web by Web.url | `drop_dm_object_name("Web")` | fillnull value="unknown" src,dest,url |  stats count,values(sourcetype) as sourcetype by src,dest,url | `threatlist_lookup_extended` | eval threat=case(isnotnull(src_threatlist_name) AND isnotnull(dest_threatlist_name),mvappend(src,NULL,dest),isnotnull(src_threatlist_name),src,isnotnull(dest_threatlist_name),dest,isnotnull(url_threatlist_name),url,1==1, threat) | search threat=* | eval risk_object=case(isnull(src_threatlist_name),src,isnull(dest_threatlist_name),dest,1=1,null()) | eval risk_score=case(isnull(src_threatlist_name),dest_risk_score+`tla_default_risk_score`,isnull(dest_threatlist_name),src_risk_score+`tla_default_risk_score`,1=1,0) | fields + sourcetype,threat,src,src_threatlist_category,src_threatlist_description,src_threatlist_name,src_risk_score,dest,dest_threatlist_category,dest_threatlist_description,dest_threatlist_name,dest_risk_score,url,url_threatlist_category,url_threatlist_description,url_threatlist_name,url_risk_score,risk_object,risk_score

[Threat - Watchlisted Events - Rule]
action.email.sendresults      = 0
action.risk                   = 1
action.risk._risk_object      = host
action.risk._risk_object_type = system
action.risk._risk_score       = 80
action.summary_index          = 1
action.summary_index._name    = notable
action.summary_index.ttl      = 1p
alert.digest_mode             = 1
alert.suppress                = 1
alert.suppress.fields         = source,sourcetype,host
alert.suppress.period         = 86300
alert.track                   = false
cron_schedule                 = */5 * * * *
disabled                      = True
dispatch.earliest_time        = rt-5m@m
dispatch.latest_time          = rt+5m@m
dispatch.rt_backfill          = 1
enableSched                   = 1
is_visible                    = false
search                        = tag=watchlist NOT sourcetype=stash | `get_event_id` | `map_notable_fields`

[Audit - Failed Threat List Download - Rule]
action.email.sendresults   = 0
action.summary_index       = 1
action.summary_index._name = notable
action.summary_index.ttl   = 1p
alert.digest_mode          = 1
alert.suppress             = 1
alert.suppress.fields      = title
alert.suppress.period      = 86300
alert.track                = false
cron_schedule              = * */3 * * *
disabled                   = true
dispatch.latest_time       = +0s
enableSched                = 1
is_visible                 = false
search                     = | rest /services/data/threatliststats  | search disabled=False is_lookup_table=False | eval threatlist_file_st_mtime=if(isnull(threatlist_file_st_mtime), 0, threatlist_file_st_mtime) | where threatlist_file_st_mtime <= time() - (interval + 3600) | `map_notable_fields`

###### Lookup Generating Searches ######
[Threalists - Threatlist Inventory - Lookup Gen]
action.email.sendresults = 0
cron_schedule            = */5 * * * *
disabled                 = False
dispatch.latest_time     = +0s
enableSched              = 1
is_visible               = false
search                   = | rest /services/data/inputs/threatlist | where target="threatlist" AND disabled=0 | rename title as name | table name weight | outputlookup threatlist_names

###### Report Searches ######
[Incident Review - Activity By Reviewer Over Time] 
action.email.reportServerEnabled          = 0
alert.track                               = 0
dispatch.latest_time                      = now
display.general.enablePreview             = 1
display.general.timeRangePicker.show      = false
display.general.type                      = visualizations
display.statistics.rowNumbers             = 0
display.statistics.wrap                   = 0
display.visualizations.charting.chart     = column
display.visualizations.charting.drilldown = all
display.visualizations.show               = 1
display.visualizations.type               = charting
search                                    = | `incident_review` | timechart useother=`useother` count by reviewer_realname

[Incident Review - Notable Events By Status]
action.email.reportServerEnabled          = 0
alert.track                               = 0
dispatch.earliest_time                    = -24h@h
dispatch.latest_time                      = now
display.general.enablePreview             = 1
display.general.type                      = visualizations
display.statistics.rowNumbers             = 0
display.statistics.wrap                   = 0
display.visualizations.charting.chart     = bar
display.visualizations.charting.drilldown = all
display.visualizations.show               = 1
search                                    = `notable` | search NOT `suppression` | stats count by status_label | rename status_label as status | sort 10 - count

[Incident Review - Top Reviewers]
action.email.reportServerEnabled     = 0
alert.track                          = 0
dispatch.latest_time                 = now
display.general.enablePreview        = 1
display.general.timeRangePicker.show = false
display.general.type                 = statistics
display.statistics.drilldown         = row
display.statistics.rowNumbers        = 0
display.statistics.wrap              = 0
display.visualizations.show          = 0
search                               = | `incident_review` | stats sparkline,count,min(_time) as firstTime,max(_time) as lastTime by reviewer_realname | `uitime(firstTime)` | `uitime(lastTime)` | sort 100 - count

[Incident Review - Recent Review Activity]
action.email.reportServerEnabled     = 0
alert.track                          = 0
dispatch.latest_time                 = now
display.general.enablePreview        = 1
display.general.timeRangePicker.show = false
display.general.type                 = statistics
display.statistics.drilldown         = row
display.statistics.rowNumbers        = 0
display.statistics.wrap              = 0
display.visualizations.show          = 0
search                               = | `incident_review` | rename status_label as status | sort 100 - _time | table _time,rule_id,status,rule_name,owner_realname,comment,reviewer_realname

[Risk - Risk Modifiers Over Time]
action.email.reportServerEnabled                    = 0
alert.track                                         = 0
dispatch.earliest_time                              = -24h@h
dispatch.latest_time                                = now
display.general.enablePreview                       = 1
display.general.type                                = visualizations
display.statistics.rowNumbers                       = 0
display.statistics.wrap                             = 0
display.visualizations.charting.chart               = column
display.visualizations.charting.axisY2.enabled      = 1
display.visualizations.charting.chart.overlayFields = count
display.visualizations.charting.legend.placement    = bottom
display.visualizations.charting.drilldown           = all
display.visualizations.show                         = 1
display.visualizations.type                         = charting
search                                              = | tstats prestats=true allow_old_summaries=`allow_old_summaries_bool` sum(All_Risk.risk_score),count from datamodel=Risk by _time span=10m | timechart minspan=10m sum(All_Risk.risk_score) as risk_score,count

[Risk - Risk Score By Object]
action.email.reportServerEnabled     = 0
alert.track                          = 0
dispatch.earliest_time               = -24h@h
dispatch.latest_time                 = now
display.general.enablePreview        = 1
display.general.type                 = statistics
display.statistics.drilldown         = row
display.statistics.rowNumbers        = 0
display.statistics.wrap              = 0
display.visualizations.show          = 0
search                               = | tstats allow_old_summaries=`allow_old_summaries_bool` sum(All_Risk.risk_score) as risk_score,dc(source) as source_count,count from datamodel=Risk by All_Risk.risk_object,All_Risk.risk_object_type | `drop_dm_object_name("All_Risk")` | sort 1000 - risk_score

[Risk - Most Active Sources]
action.email.reportServerEnabled     = 0
alert.track                          = 0
dispatch.earliest_time               = -24h@h
dispatch.latest_time                 = now
display.general.enablePreview        = 1
display.general.type                 = statistics
display.statistics.drilldown         = row
display.statistics.rowNumbers        = 0
display.statistics.wrap              = 0
display.visualizations.show          = 0
search                               = | tstats allow_old_summaries=`allow_old_summaries_bool` sum(All_Risk.risk_score) as risk_score,dc(All_Risk.risk_object) as risk_objects,count from datamodel=Risk by source | sort 1000 - count,risk_score

[Risk - Recent Risk Modifiers]
action.email.reportServerEnabled     = 0
alert.track                          = 0
dispatch.earliest_time               = -24h@h
dispatch.latest_time                 = now
display.general.enablePreview        = 1
display.general.type                 = statistics
display.statistics.drilldown         = row
display.statistics.rowNumbers        = 0
display.statistics.wrap              = 0
display.visualizations.show          = 0
search                               = | `datamodel("Risk","All_Risk")` | head 1000 | `drop_dm_object_name("All_Risk")` | table _time risk_object risk_object_type source description risk_score

[Suppressions - Currently Suppressed Events Over Time]
action.email.reportServerEnabled                    = 0
alert.track                                         = 0
dispatch.earliest_time                              = -24h@h
dispatch.latest_time                                = now
display.general.enablePreview                       = 1
display.general.type                                = visualizations
display.statistics.rowNumbers                       = 0
display.statistics.wrap                             = 0
display.visualizations.charting.chart               = line
display.visualizations.charting.chart.nullValueMode = zero
display.visualizations.charting.drilldown           = all
display.visualizations.show                         = 1
display.visualizations.type                         = charting
search                                              = `suppressed_notables` | timechart minspan=10m count by rule_name

[Suppressions - Suppression History Over Time]
action.email.reportServerEnabled                    = 0
alert.track                                         = 0
dispatch.earliest_time                              = -30d@d
dispatch.latest_time                                = now
display.general.enablePreview                       = 1
display.general.type                                = visualizations
display.statistics.rowNumbers                       = 0
display.statistics.wrap                             = 0
display.visualizations.charting.chart               = line
display.visualizations.charting.chart.nullValueMode = zero
display.visualizations.charting.drilldown           = all
display.visualizations.show                         = 1
display.visualizations.type                         = charting
search                                              = `get_summary("notable_summary","Threat - Suppressed Notables - Summary Gen")` | timechart minspan=1d sum(count) as count by rule_name

[Suppressions - Suppression Management Activity]
action.email.reportServerEnabled     = 0
alert.track                          = 0
dispatch.earliest_time               = -7d@d
dispatch.latest_time                 = now
display.general.enablePreview        = 1
display.general.type                 = statistics
display.statistics.drilldown         = row
display.statistics.rowNumbers        = 0
display.statistics.wrap              = 0
display.visualizations.show          = 0
search                               = `suppression_audit` | table _time suppression action status user

[Suppressions - Expired Suppressions]
action.email.reportServerEnabled     = 0
alert.track                          = 0
dispatch.earliest_time               = -7d@d
dispatch.latest_time                 = now
display.general.enablePreview        = 1
display.general.type                 = statistics
display.statistics.drilldown         = row
display.statistics.rowNumbers        = 0
display.statistics.wrap              = 0
display.visualizations.show          = 0
search                               = `suppression_audit-expired` | eval raw=_raw | table _time suppression raw

[Threatlist Activity - Most Active Threat Lists] 
action.email.reportServerEnabled          = 0
alert.track                               = 0
dispatch.earliest_time                    = -24h@h
dispatch.latest_time                      = now
display.general.enablePreview             = 1
display.general.timeRangePicker.show      = true
display.general.type                      = statistics
display.statistics.drilldown              = row
display.statistics.rowNumbers             = 0
display.statistics.wrap                   = 0
display.visualizations.show               = 0
search                                    = | `src_dest_tracker` | `tstats` append=true count from datamodel=Web by Web.url | `drop_dm_object_name("Web")` | fillnull value="unknown" src,dest,url | stats count by src,dest,url | `threatlist_lookup_extended` | search src_threatlist_name="*" OR dest_threatlist_name="*" OR url_threatlist_name="*" | eval threatlist_name=mvappend(src_threatlist_name,dest_threatlist_name,url_threatlist_name) | eval risk_score=count*(src_risk_score+dest_risk_score+url_risk_score) | eval system=case(isnotnull(src_threatlist_name) AND isnotnull(dest_threatlist_name),null(),isnotnull(src_threatlist_name),dest,1=1,src) | fields count system threatlist_name | mvexpand threatlist_name | lookup threatlist_names name AS threatlist_name OUTPUT weight | stats dc(system) as "Impacted Systems", sum(eval(count*weight)) as "Risk Score" by threatlist_name | sort 100 - "Risk Score"

[Threatlist Activity - Most Active Threats] 
action.email.reportServerEnabled          = 0
alert.track                               = 0
dispatch.earliest_time                    = -24h@h
dispatch.latest_time                      = now
display.general.enablePreview             = 1
display.general.timeRangePicker.show      = true
display.general.type                      = visualizations
display.statistics.rowNumbers             = 0
display.statistics.wrap                   = 0
display.visualizations.charting.chart     = bar
display.visualizations.charting.drilldown = all
display.visualizations.show               = 1
display.visualizations.type               = charting
search                                    = | `src_dest_tracker` | `tstats` append=true count from datamodel=Web by Web.url | `drop_dm_object_name("Web")` | fillnull value="unknown" src,dest,url | stats count by src,dest,url | `threatlist_lookup_extended` | search src_threatlist_name="*" OR dest_threatlist_name="*" OR url_threatlist_name="*" | eval threatlist_name=mvappend(src_threatlist_name,dest_threatlist_name,url_threatlist_name) | eval risk_score=count*(src_risk_score+dest_risk_score+url_risk_score) | eval threat=case(isnotnull(src_threatlist_name),src,isnotnull(dest_threatlist_name),dest,isnotnull(url_threatlist_name),url,1==1,"unknown") | eval risk_score=case(isnotnull(src_threatlist_name),src_risk_score,isnotnull(dest_threatlist_name),dest_risk_score,isnotnull(url_threatlist_name),url_risk_score,1==1,0) | stats sum(eval(count*risk_score)) as risk_score by threat | sort 10 -risk_score

[Threatlist Activity - Recent Threatlist Activity] 
action.email.reportServerEnabled          = 0
alert.track                               = 0
dispatch.earliest_time                    = -24h@h
dispatch.latest_time                      = now
display.general.enablePreview             = true
display.general.timeRangePicker.show      = true
display.general.type                      = statistics
display.statistics.drilldown              = row
display.statistics.rowNumbers             = 0
display.statistics.wrap                   = 0
display.visualizations.show               = 0
search                                    = | `tstats` latest(_time) as _time, count from datamodel=Intrusion_Detection by IDS_Attacks.src,IDS_Attacks.dest | `drop_dm_object_name("IDS_Attacks")` | `tstats` append=true latest(_time) as _time,count from datamodel=Network_Traffic by All_Traffic.src,All_Traffic.dest | `drop_dm_object_name("All_Traffic")` | `tstats` append=true latest(_time) as _time,count from datamodel=Web by Web.src,Web.dest | `tstats` append=true latest(_time) as _time,count from datamodel=Web by Web.url | `drop_dm_object_name("Web")` | fillnull value="unknown" src,dest,url | stats latest(_time) as _time,count by src,dest,url | `threatlist_lookup_extended` | search src_threatlist_name="*" OR dest_threatlist_name="*" OR url_threatlist_name="*" | eval threatlist_name=mvappend(src_threatlist_name,dest_threatlist_name,url_threatlist_name) | eval risk_score=count*(src_risk_score+dest_risk_score+url_risk_score) | sort 100 -_time | eval src_threatlist_name=split(replace(mvjoin(src_threatlist_name,"|"), "([^\|]*)(\|*)", "src: \1\2"),"|") | eval dest_threatlist_name=split(replace(mvjoin(dest_threatlist_name,"|"), "([^\|]*)(\|*)", "dest: \1\2"),"|") | eval url_threatlist_name=split(replace(mvjoin(url_threatlist_name,"|"), "([^\|]*)(\|*)", "url: \1\2"),"|") | eval threatlist=mvappend(src_threatlist_name, dest_threatlist_name, url_threatlist_name) | eval threatlist_description=mvappend(src_threatlist_description, dest_threatlist_description, url_threatlist_description) | fields _time,risk_score,count,threatlist,threatlist_description,src,dest,url

[Threatlist Activity - Threat List Activity Over Time] 
action.email.reportServerEnabled          = 0
alert.track                               = 0
dispatch.earliest_time                    = -24h@h
dispatch.latest_time                      = now
display.general.enablePreview             = 1
display.general.timeRangePicker.show      = true
display.general.type                      = visualizations
display.statistics.rowNumbers             = 0
display.statistics.wrap                   = 0
display.visualizations.charting.chart     = line
display.visualizations.charting.chart.nullValueMode = zero
display.visualizations.charting.drilldown = all
display.visualizations.show               = 1
display.visualizations.type               = charting
search                                    = | `tstats` count from datamodel=Intrusion_Detection by _time,IDS_Attacks.src,IDS_Attacks.dest span=10m | `drop_dm_object_name("IDS_Attacks")` | `tstats` append=true count from datamodel=Network_Traffic by _time,All_Traffic.src,All_Traffic.dest span=10m | `drop_dm_object_name("All_Traffic")` | `tstats` append=true count from datamodel=Web by _time,Web.src,Web.dest span=10m | `tstats` append=true count from datamodel=Web by _time,Web.url span=10m | `drop_dm_object_name("Web")` | fillnull value="unknown" src,dest,url | stats count by _time,src,dest,url | `threatlist_lookup_extended` | search src_threatlist_name="*" OR dest_threatlist_name="*" OR url_threatlist_name="*" | eval threatlist_name=mvappend(src_threatlist_name,dest_threatlist_name,url_threatlist_name) | eval risk_score=count*(src_risk_score+dest_risk_score+url_risk_score) | fields count threatlist_name | mvexpand threatlist_name | lookup threatlist_names name AS threatlist_name OUTPUT weight | timechart minspan=10m sum(eval(count*weight)) as risk_score by threatlist_name


###### Swim Lane Searches ######
[Threat - All Notable Events By Asset - Swimlane]
action.email.reportServerEnabled                  = 0
action.swimlane                                   = 1
action.swimlane.title                             = Notable Events
action.swimlane.color                             = yellow
action.swimlane.constraint_method                 = reverse_asset_lookup
action.swimlane.constraint_fields                 = orig_host,dvc,src,dest
action.swimlane.drilldown_search                  = $constraints$ `notable`
alert.track                                       = 0
dispatch.latest_time                              = now
display.page.asset_investigator.0.collection_name = Default
display.page.asset_investigator.0.order           = 5
is_visible                                        = false
search                                            = $constraints$ `notable` | bucket _time span=$span$ | stats values(rule_name) as rule_name,values(urgency) as urgency,values(src) as src,values(dest) as dest,count by _time

[Threat - All Notable Events By Identity - Swimlane]
action.email.reportServerEnabled                     = 0
action.swimlane                                      = 1
action.swimlane.title                                = Notable Events
action.swimlane.color                                = yellow
action.swimlane.constraint_method                    = reverse_identity_lookup
action.swimlane.constraint_fields                    = src_user,user
action.swimlane.drilldown_search                     = $constraints$ `notable`
alert.track                                          = 0
dispatch.latest_time                                 = now
display.page.identity_investigator.0.collection_name = Default
display.page.identity_investigator.0.order           = 5
is_visible                                           = false
search                                               = $constraints$ `notable` | bucket _time span=$span$ | stats values(rule_name) as rule_name,values(urgency) as urgency,values(src) as src,values(dest) as dest,count by _time

[Threat - All Risk Modifiers By Asset - Swimlane]
action.email.reportServerEnabled                  = 0
action.swimlane                                   = 1
action.swimlane.title                             = Risk Modifiers
action.swimlane.color                             = blue
action.swimlane.constraint_method                 = reverse_asset_lookup
action.swimlane.constraint_fields                 = All_Risk.risk_object
action.swimlane.drilldown_search                  = | tstats sum(All_Risk.risk_score) as risk_score from datamodel=Risk where $constraints$ by source | sort - risk_score
alert.track                                       = 0
dispatch.latest_time                              = now
display.page.asset_investigator.0.collection_name = Default
display.page.asset_investigator.0.order           = 6
is_visible                                        = false
search                                            = | tstats values(source) as source,values(All_Risk.risk_object) as risk_object,sum(All_Risk.risk_score) as count from datamodel=Risk where $constraints$ by _time span=$span$ | eval risk_score=count

[Threat - All Risk Modifiers By Identity - Swimlane]
action.email.reportServerEnabled                  = 0
action.swimlane                                   = 1
action.swimlane.title                             = Risk Modifiers
action.swimlane.color                             = blue
action.swimlane.constraint_method                 = reverse_identity_lookup
action.swimlane.constraint_fields                 = All_Risk.risk_object
action.swimlane.drilldown_search                  = | tstats sum(All_Risk.risk_score) as risk_score from datamodel=Risk where $constraints$ by source | sort - risk_score
alert.track                                       = 0
dispatch.latest_time                              = now
display.page.identity_investigator.0.collection_name = Default
display.page.identity_investigator.0.order           = 6
is_visible                                        = false
search                                            = | tstats values(source) as source,values(All_Risk.risk_object) as risk_object,sum(All_Risk.risk_score) as count from datamodel=Risk where $constraints$ by _time span=$span$ | eval risk_score=count


###### Summary Generating Searches ######
[Threat - Suppressed Notables - Summary Gen]
action.email.sendresults   = 0
action.summary_index       = 1
action.summary_index._name = notable_summary
cron_schedule              = 55 0,6,12,18 * * *
dispatch.earliest_time     = -365m@m
dispatch.latest_time       = -5m@m
enableSched                = 1
is_visible                 = false
search                     = `suppressed_notables` | stats count by security_domain, rule_name, urgency, suppression
